IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
	LCD_OpenWin(Xpos, Ypos, Xpos+wf-1, Ypos+hf-1);
	byteNr =0;
	hp_limit = Ypos + hf;
	
  for(; Ypos < hp_limit; Ypos++)		// font height 
  {
		uint8_t as;

		as = c[byteNr++];
		iw = 0;
    for(jw = 0; jw < wf; jw++)	//  loop for the font width (wf)
    {
				if(as & (0x80))
				{
					LCD_WriteData(fColor);
				}
				else
				{
					LCD_WriteData(bColor);
				}
				as <<= 1;
				iw++;
				if (iw == 8){							// reach 1 byte = 8 bits
					as = c[byteNr++];
					iw = 0;
				}
    }
	}
}

/**
  * @brief  Displays characters between a line segment on the LCD.
  * @param  Xpos: X position (in pixel)
  * @param  Ypos: Y position (in pixel)   
  * @param  Text: Pointer to string to display on LCD
  * @retval None
  */
static void LCD_DisplayStringSegment(uint16_t Xpos, uint16_t Ypos, char *Text) //, uint16_t font_width)
{
	uint16_t fColor, bColor;
	
	// wf =: font_width,
	// hf =:  font_height
// 	font_width = pLCD_Currentfonts->Width  // wf = font_width
	fColor = DrawProp.TextColor;
	bColor = DrawProp.BackColor;
  while ((*Text != 0) & (Xpos  <= (LCD_PIXEL_WIDTH - (wf-1))) )
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Xpos, Ypos, (uint8_t)*Text, fColor, bColor);
    /* Decrement the column position by 16 */
    Xpos += wf;
    /* Point on the next character */
    Text++;
  }
}

/**
  * @brief  Displays characters on the LCD.
  * @param  Xpos: X position (in pixel)
  * @param  Ypos: Y position (in pixel)   
  * @param  Text: Pointer to string to display on LCD
  * @param  Mode: Display mode
  *          This parameter can be one of the following values:
  *            @arg  CENTER_MODE
  *            @arg  RIGHT_MODE
  *            @arg  LEFT_MODE   
  * @retval None
  */
void LCD_DisplayStringAt(uint16_t Xpos, uint16_t Ypos, char *Text, Line_ModeTypdef Mode)
{
  uint32_t leftcolumn=0;
  uint32_t size = 0, xBlank=0; 
  char  *ptr = Text;
  
	// wf =: font_width,
	// hf =:  font_height
// 	font_width = pLCD_Currentfonts->Width  // wf = font_width
	if (Mode == LEFT_MODE){
				leftcolumn = Xpos;				
	} else
	{
 /* Get the text size */
		while (*ptr++) size ++ ;
  
  /* Characters number per line */
		xBlank = ((LCD_PIXEL_WIDTH+1) /wf);		// maximum number of characters per line
		if (size > xBlank){
			xBlank = 0;
		}	else {		
			xBlank = (xBlank - size)* wf;			
		}
		xBlank += (LCD_PIXEL_WIDTH+1) %wf;		// width of blank space of this string line
	}
		switch (Mode)
		{
		case LEFT_MODE:
			{
				break;
			}
		case CENTER_MODE:
			{
				leftcolumn = Xpos + xBlank/ 2;
				break;
			}
		case RIGHT_MODE:
			{
				// if leftcolumn = xBlank, the right border of the string is at the right side of the screen
				leftcolumn = LCD_PIXEL_WIDTH - Xpos;
				if (leftcolumn > xBlank){
					leftcolumn = 0;
				} else {
					leftcolumn = xBlank - leftcolumn;
				}
				break;
			}
		}
	
  /* Send the string character by character on LCD */
	LCD_DisplayStringSegment((uint16_t) leftcolumn, Ypos, Text);
}


/**
  * @brief  Displays the string on the required row and column
  * @param ount: specifies the delay time length (time base 10 ms).
  * @retval : None
  */
void LCD_DisplayStringLineCol(uint8_t LineNr, uint16_t ColNr, char *ptr)
{
  uint16_t Xpos, Ypos ;
	
	// wf =: font_width,
	// hf =:  font_height
	Xpos = ColNr * wf;
	Ypos = LineNr * hf;
	
	LCD_DisplayStringSegment(Xpos, Ypos, ptr);
}
/**
  * @brief  Draws a pixel on LCD.
  * @param  Xpos: X position 
  * @param  Ypos: Y position
  * @param  Color: Pixel color in RGB mode (5-6-5)  
  * @retval None
  */
void LCD_DrawPixel(uint16_t Xpos, uint16_t Ypos, uint16_t Color)
{
		LCD_OpenWin(Xpos, Ypos, Xpos, Ypos);
	  LCD_WriteData(Color);
}

//------------------------------------------------------------------------------
static inline void swap_u16(uint16_t* a, uint16_t* b)
{
    uint16_t t = *a;
    *a = *b;
    *b = t;
}

//------------------------------------------------------------------------------
static inline void swap_i16(int16_t *a, int16_t *b)
{
    int16_t t = *a;
    *a = *b;
    *b = t;
}

#define LCD_DrawHLine2P(x0, y0, x1, y1) 	LCD_DrawHV2P(1, x0, y0, x1, y1)
#define LCD_DrawVLine2P(x0, y0, x1, y1) 	LCD_DrawHV2P(0, x0, y0, x1, y1)
//----------------------------------------------------
void LCD_DrawHV2P(uint8_t HLine, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
		uint16_t length_m_1;
    // Horizontal Line	(y0 = y1)
		if (HLine)	{
			y1 = y0;	// make sure	
			if (x0 > x1) 	swap_u16(&x0, &x1);		// Now x0 <= x1
			length_m_1 = x1 - x0;
		} else {
			//  Vertical Line	(x0 = x1); HLine = 0: 
			x1 = x0;	// make sure	
			if (y0 > y1) 	swap_u16(&y0, &y1);		// Now y0 <= y1
			length_m_1 = y1 - y0;
		}
		LCD_OpenWin(x0, y0, x1, y1);	

	uint16_t Tcolor=DrawProp.TextColor;
	for(uint16_t i = 0; i <= length_m_1; i++)
			 LCD_WriteData(Tcolor);
}

/**
  * @brief  Draws a horizontal line on LCD.
  * @param  Xpos: X position 
  * @param  Ypos: Y position
  * @param  Length: line length
  * @param  RGB_Code: Pixel color in RGB mode (5-6-5)  
  * @retval None
  */
void LCD_DrawHLine(uint16_t Xpos, uint16_t y0, uint16_t Length)
{
//	uint16_t color=DrawProp.TextColor;
	uint16_t x1;

	if (y0 > LCD_PIXEL_HEIGHT) return;
	x1 = Xpos + Length - 1;
	if ( x1 > LCD_PIXEL_WIDTH)	x1 = LCD_PIXEL_WIDTH;
	
	LCD_DrawHLine2P( Xpos, y0, x1, y0); 	// y0 = y1
}

/**
  * @brief  Draws a vertical line on LCD.
  * @param  Xcen: X position 
  * @param  Ypos: Y position
  * @param  Length: line length
  * @param  RGB_Code: Pixel color in RGB mode (5-6-5)  
  * @retval None
  */
void LCD_DrawVLine(uint16_t x0, uint16_t Ypos, uint16_t Length)
{
//	uint16_t color=DrawProp.TextColor;
	uint16_t y1;

	if (x0 > LCD_PIXEL_WIDTH) return;
	y1 = Ypos + Length - 1;
	if ( y1 > LCD_PIXEL_HEIGHT)	y1 = LCD_PIXEL_HEIGHT;

	LCD_DrawVLine2P( x0, Ypos, x0, y1);	// x0 = x1
}

/**
  * @brief  Draws a simple cross on LCD.
  * @param  Xcen: X center position 
  * @param  Ypos: Y center position
  * @param  Length: line length
  * @param  RGB_Code: Pixel color in RGB mode (5-6-5)  
  * @retval None
  */
void LCD_DrawSimpleCross(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
{
	uint16_t hL;
	if ((Length & Bit(0)) == 0)		//even value
			Length +=1;
	
	hL = Length/2;
	LCD_DrawVLine(Xpos, Ypos-hL, Length);
	LCD_DrawHLine(Xpos-hL, Ypos, Length);
}

//--------------------------------------------------
static void LCD_DrawRect2P(uint16_t Xul, uint16_t Yul, uint16_t Xdr, uint16_t Ydr)
{
	//===  horizontal lines
	LCD_DrawHLine2P( Xul, Yul, Xdr, Yul); 	// y0 = y1
	LCD_DrawHLine2P( Xul, Ydr, Xdr, Ydr); 	// y0 = y1

	//===  vertical lines
	LCD_DrawVLine2P( Xul, Yul, Xul, Ydr); 	// x0 = x1
	LCD_DrawVLine2P( Xdr, Yul, Xdr, Ydr); 	// x0 = x1
}
/**
  * @brief  Displays a rectangle border.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: display rectangle height.
  * @param  Width: display rectangle width.
  * @retval None
  */
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
	uint16_t x1, y1;
	//===  horizontal lines
  LCD_DrawHLine(Xpos, Ypos, Width);
	x1 = (Xpos + Width - 1);
	y1 = (Ypos + Height- 1);
	if (x1 > LCD_PIXEL_WIDTH) x1 = LCD_PIXEL_WIDTH;
	if ( y1 > LCD_PIXEL_HEIGHT)	y1 = LCD_PIXEL_HEIGHT;
	
