IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
	LCD_DrawRect2P(Xpos, Ypos, x1, y1);
}
//--------------------------------------------------
void LCD_DrawRect_by_2Points(Point *pA)
{
	uint16_t x0,y0, x1, y1;
	x0 = pA[0].X;
	y0 = pA[0].Y;
	x1 = pA[1].X;
	y1 = pA[1].Y;

	LCD_DrawRect2P(x0, y0, x1, y1);	
}

/**
  * @brief  Displays a circle border.
  * @param  Xcen: specifies the X position of the center.
  * @param  Ycen: specifies the Y position of the center.
  * @param  Radius
  * @retval None
  */
void LCD_DrawCircle(uint16_t Xcen, uint16_t Ycen, uint16_t Radius)
{
	uint16_t color=DrawProp.TextColor;

  int32_t  next;/* Decision Variable */
  uint16_t  Ri;/* increasing from 0 to Radius */
  uint16_t  Rd;/* decreasing from Radius to 0 */

  next = 3 - (Radius << 1);
  Ri = 0;
  Rd = Radius;

  while (Ri <= Rd)
  {
		int32_t x0, y0;

		x0 = Xcen -	Ri;
		y0 = Ycen -	Rd;
		if(x0<0) x0=0;
		if(y0<0) y0=0;
				LCD_DrawPixel((uint16_t)x0, (uint16_t)y0, color);                          
				LCD_DrawPixel((uint16_t)x0, Ycen+Rd, color);                  
				LCD_DrawPixel(Xcen+Ri, (uint16_t)y0, color);             
				LCD_DrawPixel(Xcen+Ri, Ycen+Rd, color);             
		x0 = Xcen -	Rd;
		y0 = Ycen -	Ri;
		if(x0<0) x0=0;
		if(y0<0) y0=0;
				LCD_DrawPixel((uint16_t)x0, (uint16_t)y0, color);              	         
				LCD_DrawPixel((uint16_t)x0, Ycen+Ri, color);             
				LCD_DrawPixel(Xcen+Rd, (uint16_t)y0, color);                      
				LCD_DrawPixel(Xcen+Rd, Ycen+Ri, color);                          

    if (next < 0)
    {
      next += (Ri << 2) + 6;
    }
    else
    {
      next += ((Ri - Rd) << 2) + 10;
      Rd--;
    }
    Ri++;
  }
}

//--------------------------------------------------------------------------
static void LCD_FillRect2P(uint16_t Xpos, uint16_t Ypos, uint16_t Xend, uint16_t Yend)
{
	uint16_t color=DrawProp.TextColor;
	
		LCD_OpenWin(Xpos, Ypos, Xend, Yend);
		for(uint16_t j = Ypos; j <= Yend; j++)
			 for(uint16_t i = Xpos; i <= Xend; i++)
					 LCD_WriteData(color);
}
/**
  * @brief  Displays a full rectangle with TestColor.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: rectangle height.
  * @param  Width: rectangle width.
  * @retval None
  */
void LCD_FillRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
	uint16_t color=DrawProp.TextColor;
	uint16_t Xend = Xpos+ Width-1, Yend = Ypos + Height-1;
	
		LCD_OpenWin(Xpos, Ypos, Xend, Yend);
		for(uint16_t j = Ypos; j <= Yend; j++)
			 for(uint16_t i = Xpos; i <= Xend; i++)
					 LCD_WriteData(color);
}

/**
  * @brief  Displays a full circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius
  * @retval None
  */
void LCD_FillCircle(uint16_t Xcen, uint16_t Ycen, uint16_t Radius)
{
//	uint16_t color=DrawProp.TextColor;
  int32_t  next;/* Decision Variable */
  uint16_t  Ri;/* increasing from 0 to Radius */
  uint16_t  Rd;/* decreasing from Radius to 0 */

  next = 3 - (Radius << 1);
  Ri = 0;
  Rd = Radius;

  while (Ri <= Rd)
  {
		int32_t X0, Y0;

		X0 = Xcen - Ri;
		Y0 = Ycen -	Rd;
		if(X0<0) X0=0;
		if(Y0<0) Y0=0;
		LCD_DrawVLine((uint16_t)X0, (uint16_t)Y0, (uint16_t)(Ycen + Rd - Y0));				// vertical line in landscape  view
		X0 = Xcen + Ri;
		LCD_DrawVLine((uint16_t)X0, (uint16_t)Y0, (uint16_t)(Ycen + Rd - Y0));				// vertical line in landscape  view
		X0 = Xcen - Rd;
		Y0 = Ycen -	Ri;
		if(X0<0) X0=0;
		if(Y0<0) Y0=0;
		LCD_DrawHLine((uint16_t)X0, (uint16_t)Y0, (uint16_t)(Xcen + Rd - X0));				// horizontal line in landscape  view
		Y0 = Ycen +	Ri;
		LCD_DrawHLine((uint16_t)X0, (uint16_t)Y0, (uint16_t)(Xcen + Rd - X0));				// horizontal line in landscape  view
    if (next < 0)
    {
      next += (Ri << 2) + 6;
    }
    else
    {
      next += ((Ri - Rd) << 2) + 10;
      Rd--;
    }
    Ri++;
  }
}

//------------------------------------------------
//-----------------------------------------------------------------------			
//  positive integers: dy>0, dx>=dy>0, m = dx/2, h= y-y1 >= 0, i, 0<=r<dx.
//
//	a.  It is known that  (i*dy  + m) = h*dx + r, 0<=r<dx, h = integer[(i*dy  + m)/dx],  r = (i*dy  + m)%dx  			
//			 Note, h*dx + (v*dy + k) = (i*dy  + m), where v*dy+k = r, or v = integer(r/dy), k = r % dy < dy
//			 ==> h*dx - m = (i-v-1)*dy + (dy-k) = q * dy + z, where q=(i-v-1) = integer((h*dx - m)/dy ), z = dy-k = (h*dx - m)%dy < dy
//
//			==> h*dx - m = q*dy + z, where z = (h*dx-m) % dy < dy, q =(integer((h*dx - m)/dy )
//	Question: Find minimum w such that s = ((q+w)*dy + m)/dx >= h ==> (y1 + s) >= y1 + h = y
//        Note, when dx > dy, there are many (q+w) for a single h.
//
//	Since 1. q*dy = (h*dx - m) -z < (h*dx - m) ==> q*dy + m < h*dx
//				2. (q+1)*dy = q*dy + dy > q*dy + z = h*dx - m	since dy > z
//				When z = 0, q*dy = h*dx - m ==> w = 0; and if w >=1, then q*dy+w*dy > h*dx - m.
//				When z > 0, q*dy+w*dy = h*dx - m + w*dy -z > h*dx-m for any w >= 1, since (w*dy-z)>= (dy-z)>0; 
//	SOL. for a. ==> w_min = 0 when z = 0, or w_min = 1, when z >0.
//				Code: (q+w_min) = min_x_for_y(h, dy, dx): q=integer((h*dx - m)/dy ), z = ((h*dx - m)%dy
//			
//	b.  It is known that  q*dy + z = (h+1)*dx - m, 0<=z<dy, z = ((h+1)*dx- m) % dy		
//	    Find MAXIMUM w such that s = (q+w)*dy /dx + m < (h+1) ==> (y1 + s) < y1+(h+1) = y+1
//
//	Since q*dy <= q*dy + z = (h+1)*dx -m,  z = ((h+1)*dx- m) % dy		
//				When z = 0, (q-1)*dy = q*dy - dy < (h+1) * dx -m, since q*dy = (h+1)*dx -m ==> z = 0,  w_max = -1  
//				When z > 0, q*dy < q*dy + z = (h+1) * dx -m ==> z > 0,  w_max = 0  
//	SOL. for b. ==> w_max = -1 when z = 0, or w_max = 0, when z >0.
//  ==> Code: max_x_for_yPLUS1(h, dy, dx)
//	
//	For instance, dy = 4, dx = 14 in the following		
//        min   Max min  Max min     Max
// 	    0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17
//	h=0	o  x  x  X
//	h=1	(q=3, z=1)  x  x  X 
//	h=2	(q=7, z=0)           x  x  x  X
//	h=3	(q=10, z=1)                      x  x  X
//	h=4	(q=14, z=0)                               o  x  x  X
//-----------------------------------------------------------------------
//		x shift left by (dx/dy)/2 ==> new_i = i+(dx/dy)/2, i.e., increase i by (dx/dy)/2
//			(d/n)/2 = 1
// 	    0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17
//	h=0	o  x  X
//	h=1	         x  x  X 
//	h=2	(q=7, z=0)        x  x  x  X
//	h=3	(q=10, z=1)                   x  x  X
//	h=4	(q=14, z=0)                            x  o  x  X
//-----------------------------------------------------------------------
//------------ For dy < 0, dx>=|dy| > 0, m =-dx/2 < 0 and h = y-y1 <= 0 in the following  -------------			
//	c.  It is known that   h*dx - m = q*dy + z, 0>=z>dy, z = (h*dx- m) % dy
//			 			
//	    Find minimum w such that s=((q+w)*dy +m) /dx  <= h ==> y1 + s <= y1 + h = y
//							q*(-dy) + (-z) = (-h)*dx - (-m), 0<=(-z)<(-dy), (-z) = ((-h)*dx- (-m)) % (-dy)
//	Since (q+1)*(dy) = q*(dy) + (dy) < q*(dy) + (z) = (h)*dx - (m)	since dy < z
//				When z = 0, q*dy = h*dx - m ; and q*dy+(+1)*dy < h*dx - m, since dy < 0.
//				When z < 0, q*dy+(+1)*dy = h*dx + (dy) -m -z < h*dx-m, since dy-z < 0.
//	SOL. for c. ==> w_min = 0 when z = 0, or w_min = 1, when (-z) >0.
//  ==> Code: min_x_for_y(-h, -dy, dx)
//			
//	d.  It is known that  q*dy + z = (h+(-1))*dx - m, 0>=z>dy, z = ((h-1)*dx- m) % dy			
//	    Find MAXIMUM w such that ((q+w)*dy - m) /dx > h-1 
//					==> Find MAXIMUM w such that ((q+w)*(-dy) - (-m)) /dx < (-h) + 1
//	Since (q+1)*(-dy) = q*(-dy) + (-dy) > q*dy + z = (-h)*dx	
//	SOL. for d. ==> w_min = -1 when z = 0, or w_min = 0, when z >0.
//  ==> Code: max_x_for_yPLUS1(-h, -dy, dx)
//
//	For instance, dy = -4, dx = 14 in the following		
//        min   Max   min  Max min     Max
// 	       0  1   2   3  4  5  6  7  8  9 10  11 12 13 14 15 16 17
//	h=-4	(q=14, z=0)                                   o  x  x  X
//	h=-3	(q=10, z=-2)                         x  x  X
//	h=-2	(q=7, z=0)              x  x  x  X
//	h=-1	(q=3, z=-2)    x  x  X 
//	h=-0	 o  x   x   X
//-----------------------------------------------------------------------
//		x shift left by (dx/|dy|)/2 ==> new_i = i+(dx/|dy|)/2, i.e., increase i by (dx/|dy|)/2
//			(dx/|dy|)/2 = 1
//        min   Max   min  Max min     Max
// 	   0   1  2  3     4  5  6  7  8  9  10 11 12 13 14 15 16 17
//	h=-4	(q=14, r=0)                              x  o  x  X
//	h=-3	(q=10, z=-2)                   x  x  X
//	h=-2	(q=7, r=0)         x  x  x  X
//	h=-1	        x    x   X 
//	h=-0	 o  X
//-----------------------------------------------------------------------			
static uint16_t min_x_for_y(int16_t h, int16_t dy, uint16_t dx)
	// h > 0, dy > 0, dx > 0
{
	uint16_t z, q;
	int32_t y_t;
	
	//>>--- just for debug
	if (dy <= 0) while(1);
	if (dy > dx )	while(1);
	if (h < 0 ) while(1);
	//<<<-----------------
	y_t = h * dx - dx/2;
	q = y_t / dy;	// q = (h*dx- dx/2) / dy
	z = y_t % dy;	// z = (h*dx- dx/2) % dy
	if ( z == 0) return q;		// w_min = 0
	else	return q+1;					// w_min = 1
}
static uint16_t max_x_for_y(int16_t h, int16_t dy, uint16_t dx)
// h > 0, dy > 0, dx > 0
{
	uint16_t z, q;
	int32_t y_t;
	
	//>>--- just for debug
	if (dy <= 0) while(1);
	if (dy > dx ) while(1);
	if (h < 0 ) while(1);
	//<<<-----------------
	y_t = (h+1) * dx - dx/2;
	q = y_t / dy;	// q = ((h+1)*dx- dx/2) / dy
	z = y_t % dy; // r = ((h+1)*dx- dx/2) % dy
	if ( z == 0) return q-1;		// w_max = -1
	else	return q;							// w_max = 0;
}

//----------------------------------------------------------------------
static inline void DecomposeImStr(uint16_t* X0, uint16_t* Y0, uint16_t* width, uint16_t* height, uint16_t* X_most, uint16_t* Y_most, sImageBuf *pImageSt) 
{
			*X0 = pImageSt->topLeft.X;
			*Y0 = pImageSt->topLeft.Y;
			*width = pImageSt->width;
			*height = pImageSt->height;
			*X_most = *X0 + *width - 1;
			*Y_most = *Y0 + *height - 1;
}
////==============================================================
//------------------------------------------------------------------------------
static inline uint8_t adjust_x1_less_x2_inRange(uint16_t* p1, uint16_t* p2, uint16_t P0, uint16_t P_most)
//	Output value: 0=no more doing; 1 = OK and continue
//------------------------------------------------------------------------------
{
//	uint16_t width, height;
		if ((*p1 > P_most) || (*p2 < P0) ) return 0;	// not in the range of (X0, Y0) ~ (X_most, Y_most)
		if (*p1 < P0) *p1 = P0;			// initial point
		if (*p2 > P_most) *p2 = P_most;	// end point
	return 1;
}

