IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
//-----------------------------------------------------------
static inline void adjust_y1_y2_inRange(int16_t dy, int16_t *h1, int16_t *h2, uint16_t *y1, uint16_t *y2,
						uint16_t org_y1, uint16_t Y0, uint16_t Y_most)
{
			if (dy > 0) {
			// org_y1 = y1 < y2
				if ( *y1 < Y0 ){
					*y1 = Y0;					// org_y1 < Y0
					*h1 = Y0 - org_y1;		// h1 > 0
				}
				if (*y2 > Y_most){		// y2 > Y_most 
					*y2 = Y_most;		// y2 > org_y1 ==> Y_most >= org_y1
					*h2 = Y_most - org_y1;		// h2 >= 0	
					// h2 = 0, when org_y1 = Y_most
				}
			} else if (dy < 0) {
			// org_y1=y1 > y2
				if (*y1 > Y_most){		
					*y1 = Y_most;			// org_y1 > Y_most
					*h1 = org_y1 - Y_most;	// - (Y_most - org_y1) > 0
				}
				if (*y2 < Y0){		// y2 < Y0 
					*y2 = Y0;			// y2 > org_y1 ==> Y0 <= org_y1
					*h2 = org_y1 - Y0; // - (Y0 - org_y1) >= 0
					// h2 = 0, when org_y1 = Y0
				}
			}	
}

	volatile int16_t	gy1, gy2, gx1, gx2;
	volatile int32_t gy, gL, gR, gdx, gdy;

//=============================================================================================
static inline void PlusMinus_DrawLine_RGBBuffer(uint8_t swapXY, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2,
		 sImageBuf *pImageSt) 
{
			uint16_t X0, Y0, width, height;
			uint16_t *pBuffer;
			uint16_t X_most, Y_most;

			DecomposeImStr(&X0, &Y0, &width, &height, &X_most, &Y_most, pImageSt);
			pBuffer = pImageSt->data;
	// Now x1<=x2;
	if (swapXY) {
		swap_u16(&X0, &Y0);
		swap_u16(&X_most, &Y_most);
	}
	if ((y1 < Y0) && (y2 < Y0)) 				return;
	if ((y1 > Y_most) && (y2 > Y_most)) return; 	// not in the range of (X0, Y0) ~ (X_most, Y_most)
	
	uint16_t org_x1 = x1;
	uint16_t org_y1 = y1;
	uint16_t org_x2 = x2;
	if (! adjust_x1_less_x2_inRange(&x1, &x2, X0, X_most) ) return;

	uint16_t	dx	= org_x2 - org_x1;		// note: dx > 0 definitely
	int16_t		dy = y2 - y1;
	int16_t 	h_dx = (dy >= 0) ? dx/2: -dx/2;
		if ((x1 > org_x1))	y1 = org_y1 + ((x1 - org_x1) * dy + h_dx) / dx;	
		if ((x2 < org_x2))	y2 = org_y1 + ((x2 - org_x1) * dy + h_dx) / dx;	
			
		uint16_t	n = (dy >= 0) ? dy : -dy;
		int16_t	h1=-1, h2=-1;
		adjust_y1_y2_inRange(dy, &h1, &h2, &y1, &y2, org_y1, Y0, Y_most);
			if (h1 > 0) 	x1 = org_x1 + min_x_for_y(h1, n, dx);
			if (h2 >= 0)	x2 = org_x1 + max_x_for_y(h2, n, dx);
			// Now, x1 >= X0, y1 >= Y0; x2 <= X_most, y2 <= Y_most
	//----------------------------------
		
		uint16_t y_last;
		int16_t Dn_row = (dy >=0) ? (int16_t)width : (int16_t)-width;
		int16_t Rt_col = (dy >=0) ? +1 : -1;
		//--- for (x, y) =  (x1, y1)
			uint16_t x_m_X0 = (!swapXY) ? (x1 - X0) : (y1 -Y0);	// for x = x1
			uint32_t y_m_Y0_width = (!swapXY) ? (y1 -Y0) : (x1 - X0);	// for y = y1
			y_m_Y0_width *= width;

	//----------------------------------
	uint16_t r = dx / 2, abs_dy = ABS(dy);

	int16_t inc_y = (dy >= 0) ? 1 : -1;	// True =1, False = -1
	int32_t y_int = y1;
	if (x1 > org_x1) {
		r = r + abs_dy * (x1-org_x1) - ABS(y1-org_y1) * dx;
	}

//	uint16_t Tcolor=DrawProp.TextColor;
	for (uint16_t x = x1; x <= x2; x++) {
 		uint32_t offset; 

			offset = y_m_Y0_width + x_m_X0;		
			pBuffer[offset] = DrawProp.TextColor;
////		if (swapXY==0) {	// not swaped x, y 
//// 					LCD_DrawPixel(x, y_int, RED);
////     } else {					// has swapped x, y 
//// 					LCD_DrawPixel(y_int, x, RED);
////     }
			y_last = y_int;
//-------------------------
// 			Iteration Mehod 	
//---------------------------------------------------------------------------------			
			r += abs_dy;
			if (r >= dx){
				r -= dx;
				y_int += inc_y;
			}
	//-------- for calculating variable "offset"
			if (swapXY==0){
				if (y_int != y_last) y_m_Y0_width += Dn_row;	// +width for dy >0; -+width for dy <0
				x_m_X0 ++;		// x_m_X0 =	x+1 - X0
			} else {		// for swapXY = 1
				if (y_int != y_last) x_m_X0 += Rt_col;		// +1 for dy >0; -1 for dy <0
				y_m_Y0_width += width; // y_m_Y0_width = (x+1 - X0) * width	
			}
  }
		//----------------------------------

}

//==============================================================
static inline void Integer_DrawLine_RGBBuffer(uint8_t swapXY, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2,
		 sImageBuf *pImageSt) 
{
			uint16_t X0, Y0, width, height;
			uint16_t *pBuffer;
			uint16_t X_most, Y_most;

			DecomposeImStr(&X0, &Y0, &width, &height, &X_most, &Y_most, pImageSt);
			pBuffer = pImageSt->data;
	// Now x1<=x2;
	if (swapXY) {
		swap_u16(&X0, &Y0);
		swap_u16(&X_most, &Y_most);
	}
	if ((y1 < Y0) && (y2 < Y0)) 				return;
	if ((y1 > Y_most) && (y2 > Y_most)) return; 	// not in the range of (X0, Y0) ~ (X_most, Y_most)
	
	uint16_t org_x1 = x1;
	uint16_t org_y1 = y1;
	uint16_t org_x2 = x2;
	if (! adjust_x1_less_x2_inRange(&x1, &x2, X0, X_most) ) return;

	uint16_t	dx	= org_x2 - org_x1;		// note: dx > 0 definitely
	int16_t		dy = y2 - y1;
	int16_t 	h_dx = (dy >= 0) ? dx/2: -dx/2;
		if ((x1 > org_x1))	y1 = org_y1 + ((x1 - org_x1) * dy + h_dx) / dx;	
		if ((x2 < org_x2))	y2 = org_y1 + ((x2 - org_x1) * dy + h_dx) / dx;	
			
		uint16_t	n = (dy >= 0) ? dy : -dy;
		int16_t	h1=-1, h2=-1;
		adjust_y1_y2_inRange(dy, &h1, &h2, &y1, &y2, org_y1, Y0, Y_most);
			if (h1 > 0) x1 = org_x1 + min_x_for_y(h1, n, dx);
			if (h2 >= 0)	x2 = org_x1 + max_x_for_y(h2, n, dx);
			// Now, x1 >= X0, y1 >= Y0; x2 <= X_most, y2 <= Y_most
		h2 = org_y1 + ((x2 - org_x1) * dy + h_dx) / dx;	
		if (h2 != y2) while(1);
	//----------------------------------
		

		uint16_t y_last;
		int16_t Dn_row = (dy >=0) ? (int16_t)width : (int16_t)-width;
		int16_t Rt_col = (dy >=0) ? +1 : -1;
		//--- for (x, y) =  (x1, y1)
			uint16_t x_m_X0 = (!swapXY) ? (x1 - X0) : (y1 -Y0);	// for x = x1
			uint32_t y_m_Y0_width = (!swapXY) ? (y1 -Y0) : (x1 - X0);	// for y = y1
			y_m_Y0_width *= width;

		uint16_t y = y1;
		int16_t inc = (dy >= 0) ? dx/2: -dx/2;
		inc += (x1 - org_x1) * dy;
		// Note: inc = (x1 - org_x1) * dy + sgn(dy) * dy/2;
	for (uint16_t x = x1; x <= x2; x++) {
		uint32_t offset; 

//#define Debug_rigorousness
#ifdef Debug_rigorousness
 		if ((y < Y0) || (y > Y_most)) {	
			return;			// no more inside the range
		} else { //		if ((y >= Y0) && (y <=Y_most)) {	
#endif		
			offset = y_m_Y0_width + x_m_X0;		
			pBuffer[offset] = DrawProp.TextColor;
/*--------- Want to debug, then uncomment the following lines  -----*/
//#define Debug_Buffer
#ifdef Debug_Buffer
		uint16_t Tcolor = RED;
		uint32_t tmpx, tmpy;
			if (swapXY==0) {
				LCD_DrawPixel(x, y, Tcolor);
				tmpx = x-X0; 
				tmpy = (y-Y0)*width;
      } else 	{	// x <--> y;  X0 <--> Y0
				LCD_DrawPixel(y, x, Tcolor);
				tmpx = (y-Y0);
				tmpy = (x-X0) * width ;
			}
				if (tmpx != x_m_X0) while(1);
				if (tmpy != y_m_Y0_width) while(1);
			}
#endif
//<<<<<<<---------------------------------------------------------			
#ifdef Debug_rigorousness
		}		// END of if ((y >= Y0) && (y <=Y_most))
#endif
		y_last = y;
		inc += dy; 								// for x+1: ((x+1) - org_x1) * dy + sgn(dy) * dy/2
		y = org_y1 + (inc) / dx;	// for x+1: y = org_y1 + ((x+1-org_x1) * dy + dx/2) / dx;
	//-------- for calculating variable "offset"
		if (!swapXY){
			if (y != y_last) y_m_Y0_width += Dn_row;	// +width for dy >0; -+width for dy <0
			x_m_X0 ++;		// x_m_X0 =	x+1 - X0
		} else {		// for swapXY = 1
			if (y != y_last) x_m_X0 += Rt_col;		// +1 for dy >0; -1 for dy <0
			y_m_Y0_width += width; // y_m_Y0_width = (x+1 - X0) * width	
		}
	}

