IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
}

//--------------------------------------------------------------------------
static void	draw_HVline_inBuffer(uint8_t HLine, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, sImageBuf *pImageSt) 
{
			uint16_t X0, Y0, width, height;
			uint16_t *pBuffer;
			uint16_t X_most, Y_most;

			DecomposeImStr(&X0, &Y0, &width, &height, &X_most, &Y_most, pImageSt);
			pBuffer = pImageSt->data;

		uint16_t length_m_1;
    // Horizontal Line	(y0 = y1)
		if (HLine)	{
			y2 = y1;	// make sure	
			if ((y1 < Y0) || (y1 > Y_most)) return; // not in the range of (X0, Y0) ~ (X_most, Y_most)
			if (x1 > x2) 	swap_u16(&x1, &x2);		// Now x1 <= x2
			if (!adjust_x1_less_x2_inRange(&x1, &x2, X0, X_most) ) return;
			length_m_1 = x2 - x1;
		} else {
			//  Vertical Line	(x0 = x1); HLine = 0: 
			x2 = x1;	// make sure	
			if ((x1 < X0) || (x1 > X_most)) return; // not in the range of (X0, Y0) ~ (X_most, Y_most)
			if (y1 > y2) 	swap_u16(&y1, &y2);		// Now y1 <= y2
			if (!adjust_x1_less_x2_inRange(&y1, &y2, Y0, Y_most) ) return;
			length_m_1 = y2 - y1;
		}
	
		uint16_t offset = (y1 -Y0) * width + (x1 - X0);	// initial value

		for (uint16_t i = 0; i <= length_m_1; i++){		// do only when X_most >= x2 >= x1 >= X0
			pBuffer[offset] = DrawProp.TextColor;
			if (HLine)	offset ++;		// for horizontal line
			else 	offset += width; // for vertical line	
		}
}		

//=======================================================================
void LCD_DrawLine_RGBbuffer(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, sImageBuf *pImageSt)
{
		if (pImageSt == 0) return;  // no image buffer

	uint16_t deltaX, deltaY;

	deltaX = (uint16_t)ABS(x2 - x1);        /* The difference between the x's */
  deltaY = (uint16_t)ABS(y2 - y1);        /* The difference between the y's */
	//>>>>--------------------------------------------------------
	
	if ((deltaY == 0) || (deltaX == 0)) {
			// Horizontal Line (y1 = y2)
		uint8_t HLine = 1;
			// Vertical Line	(x1 = x2)
		if (deltaX == 0) HLine = 0;
			draw_HVline_inBuffer(HLine, x1, y1, x2, y2, pImageSt);	// y1 = y2
			return;
	}

     // General:      (x1 != x2, otherwise 0 = deltaX = deltaY = dy = 0)
	uint8_t swapXY = deltaX < deltaY;
   if (swapXY) {		// if (ABS(y1 - y0) > ABS(x1 - x0))
			swap_u16(&x1, &y1);
			swap_u16(&x2, &y2);
    }	
		// now, ABS(x2 - x1) >= ABS(y2 - y1)
   if (x1 > x2) {
			swap_u16(&x1, &x2);
			swap_u16(&y1, &y2);
    }		// Now x0 <= x1

			PlusMinus_DrawLine_RGBBuffer(swapXY, x1, y1, x2, y2, pImageSt);		
//			Integer_DrawLine_RGBBuffer(swapXY, x1, y1, x2, y2, pImageSt);
}

/**
  * @brief  Displays an uni-line (between two points).
  * @param  x1: specifies the point 1 x position.
  * @param  y1: specifies the point 1 y position.
  * @param  x2: specifies the point 2 x position.
  * @param  y2: specifies the point 2 y position.
  * @retval None
  */
	//------------------------------------------------

#define Q16 16
static inline void Qformat_DrawLine(uint8_t swapXY, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
//-----------------------------------------	
//		Line is shifted left by (dx/|dy|)/2 ==> new_i = i + (dx/|dy|)/2 and h[0]=1/2;
//			(new_i) * dy = i* dy + (dx/2) * (dy/|dy|) = i*dy + sgn(dy) * (dx/2)
//			define m =: sgn(dy) * (dx/2);		
//		==> Floating Point:	 i * dy + m = h[i] * dx, so that h[0] = m/dx = sgn(dy) * 1/2
//		==> Round off Method: h[i] = (i * dy )/dx +1/2 
//		==> Q format rule for negative: 
//				-5.1 ==>	(-51<<8)/10 >>8 = (-13056/10) >>8 = (-1305) >>8 = -6
//				-5.5 ==>	(-55<<8)/10 >>8 = (-14080/10) >>8 = (-1408) >>8 = -6
//				-5.9 ==> 	(-59<<8)/10 >>8 = (-15104/10) >>8 = (-1510) >>8 = -6
//
//	  ==> Q format:  g = (dy<<16)/dx;	M = 1/2 = 1 <<15;
//	                 h[i] = M + (i * g); 
//                   y[i] = y1 + h[i] >>16 = [(y1<<16 + M) + (i*g)] >>16; 
//-----------------------------------------	
//	For instance, dy = 4, dx = 14 in the following: (dx/dy)/2 = 1.75, dx/2 = 7		
// 	    0  1   2   3  4   5   6  7   8   9   10  11  12  13  14 
//	h=0	xo xo  xo  X																						(3*4/14= 0.85) ==> ((3+1.75)*(4))/14) = (3*(4) + 1.75*4) /14) = 19/14 = 1.35
//	h=1	  				 o  xo  xo Xo
//	h=2	           |<-|				   xo  xo  xo  X
//	h=3	                     						      o  xo  Xo  X      (13*4/14= 3.71) ==> ((13+1.75)*(4))/14) = (3*(4) + 1.75*4) /14) = 59/14 = 4.21
//	h=4	                             							       o   xo
//-----------------------------------------------------------------------
//	For instance, dy = -4, dx = 14 in the following	(dx/|dy|)/2 = 1; dx/2 = 7		
//        min   Max   min  Max min     Max
// 	   0   1   2   3   4   5   6   7   8   9  10  11  12  13  14
//	h=-4	                                                 o  xo  (-14*4/14= -4) 
//	h=-3	                                     o  xo  xo  X				(-13*4/14= -3.71)
//	h=-2	          |<-|           xo  xo  xo  X									(-10*4/14= -2.85) ==> (32768+ 10*(-18724)) >> 16 = -3
//	h=-1	          o  xo  xo  Xo 																(-4*4/14= -1) 
//	h=0	   xo  xo  X																							(-3*4/14= -0.85) ==> ((1<<15) + 3 * [(-4)<<16/dx] ) = (32768+ 3*(-18724)) >> 16 = -1
//-----------------------------------------------------------------------
//-----------------------------------------	
{
   uint16_t dx = x2 - x1;
   int16_t dy = y2 - y1;
    int32_t gradient = (dx == 0) ? 0 : ((int32_t)dy << Q16) / dx;
		// Note: dx >= ABS(dy), if dx==0, then dy == 0
		//--- dx!=0 && dy==0 ==> gradient = 0 a horizontal line (swapXY=0) or a vertical line (swapXY=1);

    int32_t y = y1 << Q16;	
						y += 1<< (Q16 -1);  // += 0.5 << 16 for Round off
		
		uint16_t Tcolor=DrawProp.TextColor;
    for (uint16_t x = x1; x <= x2; x++) {
			int32_t y_int = y >> Q16;		// (y) >> FP_SHIFT
      if (swapXY==0) {	// not swap x, y 
 					LCD_DrawPixel(x, y_int, Tcolor);
      } else {					// has swapped x, y 
 					LCD_DrawPixel(y_int, x, Tcolor);
      }
       y += gradient;
    }
	}

static inline void PlusMinus_DrawLine(uint8_t swapXY, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
//-----------------------------------------	
//			y = y1 + ((x-x1) * dy + sgn(dy) * dx/2) / dx;	// from original y1 to y2
//                     -------------------------
//			When along y:   (x-x1) * dy  + z = (y-y1) * dx + my, where z = ((y-y1) * dx - m) % dy  
//     ==> i=(y-y1); inc[i] = i*dx + my = inc[i-1] + dx; x[i] = x1 + inc[i]/dy;
//-----------------------------------------	
//		==> Iteration for dy > 0: r[0] = dy/2 for dy >= dx; r[0] = -|dx|/2 for dy < dx.
//		==> Iteration:  inc_x = (dx > 0) ? +1 : -1;
//		               r[i] = r[i-1] + |dx|; 
//                    while (r[i] >= dy) {r[i] -= dy; x[i] += inc_x;}
//-----------------------------------------	
{
		// now, ABS(x2 - x1) >= ABS(y2 - y1)
		// Now x0 <= x1
	int16_t dy = y2 - y1;
	uint16_t dx = x2 - x1;
	uint16_t r = dx / 2, abs_dy = ABS(dy);

	int16_t inc_y = (dy >= 0) ? 1 : -1;	// True =1, False = -1
	int32_t y_int = y1;

	uint16_t Tcolor=DrawProp.TextColor;
	for (uint16_t x = x1; x <= x2; x++) {
      if (swapXY==0)	LCD_DrawPixel(x, (uint16_t) y_int, Tcolor);
      else	 					LCD_DrawPixel((uint16_t) y_int, x, Tcolor);
//-------------------------
// 			Iteration Mehod for			
//			s = dx/2;	if (dy < 0) s = -s;
//			if y_int = y1 + ((x-x1) * dy + (s)) / dx;	// from original y1 to y2
//	Use plus and minus instead of multiplication			
//---------------------------------------------------------------------------------			
			r += abs_dy;
			if (r >= dx){
//			while (r >= dx) {
				r -= dx;
				y_int += inc_y;
			}
    }
}

//-----------------------------------------	
//			y = y1 + ((x-x1) * dy + sgn(dy) * dx/2) / dx;	// from original y1 to y2
//                     -------------------------
//			When along y:   (x-x1) * dy  + z = (y-y1) * dx + my, where z = ((y-y1) * dx - m) % dy  
//     ==> i=(y-y1); inc[i] = i*dx + my = inc[i-1] + dx; x[i] = x1 + inc[i]/dy;
//-----------------------------------------	
//		==> Iteration for dy > 0: r[0] = dy/2 for dy >= dx; r[0] = -|dx|/2 for dy < dx.
//		==> Iteration:  inc_x = (dx > 0) ? +1 : -1;
//		               r[i] = r[i-1] + |dx|; 
//                    while (r[i] >= dy) {r[i] -= dy; x[i] += inc_x;}
//-----------------------------------------	
//  dx > 0: a.  x[i+1] (for r[i+1] = 0) or (x[i+1] +1) (for r[i+1] != 0) is the minimum x for y+1.
//          b.  And (x[i+1]-1) (for r[i+1] = 0) or x[i+1] (for r[i+1] != 0) is the maximum x for y.
//  dx < 0: a.  x[i+1] (for r[i+1] = 0) or (x[i+1] -1) (for r[i+1] != 0) is the maximun x for y+1.
//          b.  And (x[i+1]+1) (for r[i+1] = 0) or x[i+1] (for r[i+1] != 0) is the minimum x for y.
//-----------------------------------------	
static inline void PlusMinus_DrawLineAA(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
   if (y1 > y2) {
			swap_u16(&x1, &x2);
			swap_u16(&y1, &y2);
    }		// Now y1 < y2
	uint16_t dy = y2 - y1;		// dy > 0
	int16_t dx = x2 - x1;
	uint16_t abs_dx = ABS(dx);
	int16_t r = (dy >= abs_dx) ? dy / 2 : -abs_dx/2;
		//	For dy < ABS(dx):  inc = -sgn(dy)*dx/2 = -dx/2;	// note, dy>0;
	int16_t inc_x = (dx >= 0) ? 1 : -1;	// True =1, False = -1
		
