IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
	int32_t xL = x1, xR = x1, x_int = x1;
	for (uint16_t y = y1; y <= y2; y++) {
		int16_t x;
//-------------------------
//	Use Addition and Subtraction instead of multiplication and division	for "inc"		
//---------------------------------------------------------------------------------	
//			inc += dx; 				// inc = (y-y1) * dx + sgn(dx) * dy/2; 
//			x = x1 + (inc) / dy;	
//-------------------------------
			r += abs_dx;
			while (r >= dy) {
				r -= dy;
				x_int += inc_x;		// 1 for dx > 0; -1 for dx < 0.
			}
			x = x_int;
				// for the present y: 
				// (if |dx| > dy) many x's per y; otherwise (|dx| < dy) only one x per y, but may be same single x for different y. 
		if ((abs_dx > dy)) {
				// z == 0 ==> max or min x for present y: max: dx> 0, xR = x-1; min: dx <0, xL = x+1
				// z != 0 ==> maxi or min x for present y: max: dx> 0, xR = x; min: dx <0, xL = x;
				//        ==> min or max x for next y=y+1: z==0: x; z!=0: dx> 0, x_min = x++; dx <0, x_max = x--;
				if (dx > 0) {
						if (r == 0) xR = x - 1;
						else				xR = x++;
						if (xR > x2) xR = x2;
				} else		{
						if (r == 0) xL = x + 1;
						else				xL = x--;
						if (xL < x2) xL = x2;
				}
		}
		LCD_DrawHLine2P( (uint16_t) xL, y, (uint16_t) xR, y);
				// for the next y = y+1
		xL = xR = x;
	}
}

//-----------------------------------------------------------------
//-----------------------------------------	
//			y = y1 + ((x-x1) * dy + sgn(dy) * dx/2) / dx;	// from original x1 to x2; dx > 0
//                     -------------------------
//		Line is shifted left by (dx/|dy|)/2 ==> new_i = i + (dx/|dy|)/2;
//			(new_i) * dy = i* dy + (dx/2) * (dy/|dy|) = i*dy + sgn(dy) * (dx/2)
//			define mX =: sgn(dy) * (dx/2);	
//			define mY =: sgn(dx) * (dy/2);	
//                     -------------------------
//									Integer Format:	
//		1. When dx >= |dy| > 0: (y-y1) * dx  + r = (x-x1) * dy + mX, where dx > r = ((x-x1) * dy + mX) % dx  
//     ==> i=(x-x1); inc[i] = i*dy + mX = inc[i-1] + dy; y[i] = y1 + inc[i]/dx; 
//		2. When 0 < |dx| < dy:  (x-x1) * dy  + z = (y-y1) * dx + mY, where dy > z = ((y-y1) * dx - mY) % dy  
//     ==> i=(y-y1); inc[i] = i*dx + mY = inc[i-1] + dx; x[i] = x1 + inc[i]/dy;
//
//	Use y direction to compute the case of |dx| > |dy| and assume dy > 0:
//      (x-x1) * dy  - r = (y-y1) * dx - mX  ==> (x-x1) * dy  - k*dy + z[i] = (y-y1) * dx - mX,
//        where 0<= z = ((y-y1) * dx - mX) % dy < dy
//              x-k is the minimum x for y. 
//      Note:  ((x-k) + dx/dy) *dy + z[i+1] = (y-y1) * dx - mX + dx = ((y+1)-y1) * dx - mX 
//          ==> Let x[i+1] = x-k+dx/dy ==> x[i+1] *dy + z[i+1] = ((y+1) - y1) - mX
// dx>0:    a.  x[i+1] (for z[i+1] = 0) or (x[i+1] +1) (for z[i+1] != 0) is the minimum x for y+1.
//          b.  And (x[i+1]-1) (for z[i+1] = 0) or x[i+1] (for z[i+1] != 0) is the maximum x for y.
// dx<0:    a.  x[i+1] (for z[i+1] = 0) or (x[i+1] -1) (for z[i+1] != 0) is the mximum x for y+1.
//          b.  And (x[i+1]+1) (for z[i+1] = 0) or x[i+1] (for z[i+1] != 0) is the minimum x for y.
//---------------------------------------------------------------------------------
static inline void Integer_DrawLineAA(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
   if (y1 > y2) {
			swap_u16(&x1, &x2);
			swap_u16(&y1, &y2);
    }		// Now y1 < y2
	uint16_t dy = y2 - y1;		// dy > 0
	int16_t dx = x2 - x1;

	uint16_t abs_dx = ABS(dx);
	int16_t sgn_dx = (dx>0) ? +1 : -1;
	int16_t inc = (dy >= ABS(dx)) ? (sgn_dx * dy)/2 : -dx/2;
		//	For dy < ABS(dx):  inc = -sgn(dy)*dx/2 = -dx/2;	// note, dy>0;

	int32_t xL = x1, xR = x1;
	for (uint16_t y = y1; y <= y2; y++) {
		int16_t x, z;
//-------------------------
//	Use Addition and Subtraction instead of multiplication and division	for "inc"		
//---------------------------------------------------------------------------------	
		inc += dx; 				// inc = (y-y1) * dx + sgn(dx) * dy/2; 
		x = x1 + inc / dy;
				// for the present y: 
				// (if |dx| > dy) many x's per y; otherwise (|dx| < dy) only one x per y, but may be same single x for different y. 
		if ((abs_dx > dy) ) {
				z = inc % dy;
				// z == 0 ==> max or min x for present y: max: dx> 0, xR = x-1; min: dx <0, xL = x+1
				// z != 0 ==> maxi or min x for present y: max: dx> 0, xR = x; min: dx <0, xL = x;
				//        ==> min or max x for next y=y+1: z==0: x; z!=0: dx> 0, x_min = x++; dx <0, x_max = x--;
				if (dx > 0) {
						if (z == 0) xR = x - 1;
						else				xR = x++;
						if (xR > x2) xR = x2;
				} else		{
						if (z == 0) xL = x + 1;
						else				xL = x--;
						if (xL < x2) xL = x2;
				}
		}
		LCD_DrawHLine2P( (uint16_t) xL, y, (uint16_t) xR, y);
					// for the next y = y+1
		xL = xR = x;
	}
}



//-----------------------------------------------------------------
static inline void Integer_DrawLine(uint8_t swapXY, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
		// now, ABS(x2 - x1) >= ABS(y2 - y1)
		// Now x0 <= x1
	uint16_t dx = x2 - x1;
	int16_t dy = y2 - y1;

	uint16_t y = y1;
	int32_t inc = (dy >= 0) ? dx/2: -dx/2;
	// ==> inc = (x1 - x1)*dy + sgn(dy) * dx/2;

	uint16_t Tcolor = DrawProp.TextColor;
	for (uint16_t x = x1; x <= x2; x++) {
      if (swapXY==0)	LCD_DrawPixel(x, y, Tcolor);
      else						LCD_DrawPixel(y, x, Tcolor);
//-------------------------
//	Use Addition and Subtraction instead of multiplication and division	for "inc"		
//---------------------------------------------------------------------------------		
			inc += dy; 				// inc = (x+1 - x1) * dy + sgn(dy) * dx/2; 
			y = y1 + (inc) / dx;	// y for (x+1): y = y1 + ((x+1-x1) * dy + sgn(dy) * dx/2) / dx
  }
}

//------------------------------------------------
//===============================================================
void LCD_DrawLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
	uint16_t deltaX, deltaY;

	deltaX = (uint16_t)ABS(x2 - x1);        /* The difference between the x's */
  deltaY = (uint16_t)ABS(y2 - y1);        /* The difference between the y's */

