IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
	if ((deltaY == 0) || (deltaX == 0)) {
			// Horizontal Line (y1 = y2)
		uint8_t HLine = 1;
			// Vertical Line	(x1 = x2)
		if (deltaX == 0) HLine = 0;
			LCD_DrawHV2P(HLine, x1, y1, x2, y2);
			return;
	}

    // General:      (x1 != x2, otherwise 0 = deltaX = deltaY = dy = 0)
//		DrawProp.TextColor = WHITE;
		PlusMinus_DrawLineAA(x1, y1, x2, y2);		// iteration method is the quickest way
//		Integer_DrawLineAA(x1, y1, x2, y2);		// tradional method
//-------------------------------------------	
// The following methods are not recommended,
//		but are used for verifying!
//-------------------------------------------
//	uint8_t swapXY = deltaX < deltaY;
//    if (swapXY) {		// if (ABS(y1 - y0) > ABS(x1 - x0))
//			swap_u16(&x1, &y1);
//			swap_u16(&x2, &y2);
//    }	
//		// now, ABS(x2 - x1) >= ABS(y2 - y1)
//    if (x1 > x2) {
//			swap_u16(&x1, &x2);
//			swap_u16(&y1, &y2);
//    }		// Now x1 < x2, ABS(x2 - x1) >= ABS(y2 - y1)

//		DrawProp.TextColor = RED;
//		Integer_DrawLine(swapXY, x1, y1, x2, y2);		// tradional method
//		Qformat_DrawLine(swapXY, x1, y1, x2, y2);
}


/**
  * @brief  Displays a mono-color picture.
  * @param  Pict: pointer to the picture array.
  * @retval None
  */
void LCD_DrawMonoPict(const uint32_t *Pict)
{
	uint16_t fcolor=DrawProp.TextColor;
	uint16_t bcolor=DrawProp.BackColor;
  uint32_t index = 0, i = 0;

  LCD_OpenWin(0, 0, LCD_PIXEL_WIDTH, LCD_PIXEL_HEIGHT);
//  LCD_SetCursor(0, (LCD_PIXEL_WIDTH - 1));
//  LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
 
	for(index = 0; index < 2400; index++)
  {
    for(i = 0; i < 32; i++)						// 2400 x 32 = 240 x 320
    {
      if((Pict[index] & (1 << i)) == 0x00)
      {
        LCD_WriteData(bcolor);		// background color
      }
      else
      {
        LCD_WriteData(fcolor);
      }
    }
  }
}

/**
  * @brief  Draws a bitmap picture (16 bpp) (24 bpp will be transfered to 16 bpp automatically).
  * @param  Xpos: Bmp X position in the LCD
  * @param  Ypos: Bmp Y position in the LCD
  * @param  pbmp: Pointer to Bmp picture address.
  * @retval None
  */
void LCD_DrawBitmap(uint16_t Xpos, uint16_t Ypos, uint8_t *BmpAddress)	
{
  uint32_t index; 
  uint16_t bitCount;
	
	uint32_t height, i, n;
  uint32_t width, j, j_ignore;
  
  //---------------->>>>>>>>>>>>>>>
	/* Read BMP signature */
  width = *(uint16_t *) (BmpAddress + 0);
	if (width != 0x4D42) return;
	
  /* Read bitmap width */
  width = *(uint16_t *) (BmpAddress + 18);
  width |= (*(uint16_t *) (BmpAddress + 20)) << 16;
  
  /* Read bitmap height */
  height = *(uint16_t *) (BmpAddress + 22);
  height |= (*(uint16_t *) (BmpAddress + 24)) << 16; 

	//-----------------<<<<<<<<<<<<<<<<<<<<<
  
  /* Read number of bits per pixel */
  bitCount = *(uint16_t *) (BmpAddress + 28);

  /* Read bitmap size */
  /* Get bitmap data address offset */
  index = *(__IO uint16_t *) (BmpAddress + 10);
  index |= (*(__IO uint16_t *) (BmpAddress + 12)) << 16;
  BmpAddress += index;
	
//>>>######################################################
  /* Set GRAM write direction and BGR = 1 */
		LCD_WriteReg(0x36);  // Memory Access Control (36h)
  #if (LANDSCAPE == 1)
    /* BMP updates from bottom to top and left to right        */
		LCD_WriteData(0xE8);	// bit 7, 6, 5, 3 = 1  
		// bit 3 (BGR) = 1
		// bit 5 (column and row exchange) = 1
		// bit 6 (column addr. order) = 1   width ==> 0
    // bit 7 (page (row) addr. order) = 1  height ==> 0
		//
		//   column (y) 
		//   ^
		//   |
		//   |
		//   --------------------> page (x)
		//
  #else
    /* AM=0   (address is updated in horizontal writing direction)            */
		LCD_WriteData(0x48);	// bit 7, 6, 3 = 1  
		// bit 3 (BGR) = 1
		// bit 6 (column addr. order) = 1   width ==> 0
    // bit 7 (page (row) addr. order) = 0  height ==> 0
		//
		//   column (x) 
		//   ^
		//   |
		//   |
		//   --------------------> page (y)
		//
  #endif
//<<<######################################
//	LCD_DisplayWindow_WnH(Xpos, 241-(Ypos+height), width, height);
//	LCD_DisplayWindow_WnH(Xpos, LCD_PIXEL_HEIGHT-(Ypos+(height-1)), width, height);			// corrected on 2024.07.17
//>>>>>########### revised on 2024.08.01 ###############################
	i = Ypos + height - 1;			// Y1
	n = 0;
	if (i > LCD_PIXEL_HEIGHT){
		n = i - LCD_PIXEL_HEIGHT;			// ignore the image part on the last "n" lines
		i = LCD_PIXEL_HEIGHT;
	}
	j = Xpos + width - 1;			// X1
	j_ignore = width;
	if (j > LCD_PIXEL_WIDTH){
		if (Xpos > LCD_PIXEL_WIDTH) j_ignore = 0;
		else j_ignore = (LCD_PIXEL_WIDTH+1) - Xpos;
		j = LCD_PIXEL_WIDTH;
	}
	LCD_OpenWin(Xpos, LCD_PIXEL_HEIGHT-i,  j,  LCD_PIXEL_HEIGHT-Ypos);	// i.e., LCD_OpenWin(X0, Y0,  X1,  Y1);
//<<<<<########### revised on 2024.08.01 ###############################

  if (bitCount == 24)
	{
		uint8_t skip;
		uint16_t n_ignore = width - j_ignore;		//#### revised on 2024.08.01
		
		skip = 0x03 & (4 - ( (width*3) &0x03));   // align in 4 multiple
		if (n > 0){																// ignore "n" lines
			BmpAddress += n * (3*width + skip);					//#### revised on 2024.08.01
		}
			
		for (i = n; i<height; i++)				
		{ 
			for (j=0; j<j_ignore; j++)	//#### revised on 2024.08.01
			{
				uint16_t temp;
/*				uint16_t t2;
				t2 = (*(__IO uint8_t *)BmpAddress++);
				temp = t2 >>3;
				t2 = (*(__IO uint8_t *)(BmpAddress++));
				temp |= (t2 >>3)<<6;
				t2 = (*(__IO uint8_t *)(BmpAddress++));
				temp |= (t2 >>3)<<(5+6);
*/
					temp = (*(__IO uint8_t *)BmpAddress++)>>3;
					temp |= ((*(__IO uint8_t *)(BmpAddress++) )>> 3)  << 6;
					temp |= ((*(__IO uint8_t *) (BmpAddress++) )>> 3)  << (6+5);
					LCD_WriteData(temp);
			}
			BmpAddress += 3*n_ignore;					//#### revised on 2024.08.01
			BmpAddress += skip;
		}
	}
	else // bitCount == 16 [RED (5bits): GREEN (6bits): BLUE (5bits)]
	{
//>>>>>########### revised on 2024.08.01 ###############################
		uint16_t n_ignore = width - j_ignore;		

		if (n > 0){				// ignore "n" lines		
			BmpAddress += n * (2*width);
		}
		
		for (i = n; i<height; i++)				
		{ 
			for (j=0; j<j_ignore; j++)	//#### revised on 2024.08.01
			{
				LCD_WriteData(*(__IO uint16_t *)BmpAddress);
				BmpAddress += 2;
			}
			BmpAddress += 2 * n_ignore;					//#### revised on 2024.08.01
		}
//<<<<<########### revised on 2024.08.01 ###############################
  }

//>>>######################################################
  /* Set GRAM write direction and BGR = 1 */
		LCD_WriteReg(0x36);  // Memory Access Control (36h)
  #if (LANDSCAPE == 1)
		LCD_WriteData(0xA8);	// bit 7, 5, 3 = 1  
		// bit 3 (BGR) = 1
		// bit 5 (column and row exchange) = 1
		// bit 6 (column addr. order) = 0   0 ==> width 
    // bit 7 (page (row) addr. order) = 1  height ==> 0
		//
		//   --------------------> page (x)
		//   |
		//   |
		//   \/
		//   column (y) 
		//
  #else
		LCD_WriteData(0xC8);	// bit 7, 6, 3 = 1  
		// bit 3 (BGR) = 1
		// bit 6 (column addr. order) = 1   width ==> 0
    // bit 7 (page (row) addr. order) = 1  height ==> 0
		//
		//   column (x) 
		//   ^
		//   |
		//   |
		//   --------------------> page (y)
		//
  #endif
//<<<######################################
}

//---------------------------------
static void LCD_DrawRGBImage_2P(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t *pdata)
{
	if (!pdata) {
		LCD_FillRect2P(x0, y0, x1, y1);
		return;
	}
	LCD_OpenWin(x0, y0, x1, y1);  

  for(uint16_t j= y0; j <= y1; j++)
		for(uint16_t i= x0; i <= x1; i++)
		{
			uint16_t pixel = *(volatile uint16_t *)pdata;
			LCD_WriteData(pixel);
			pdata += 2;
		}
}
/**
  * @brief  Draws RGB Image (16 bpp).
  * @param  Xpos:  X position in the LCD
  * @param  Ypos:  Y position in the LCD
  * @param  Xsize: X size in the LCD
  * @param  Ysize: Y size in the LCD
  * @param  pdata: Pointer to the RGB Image address.
  * @retval None
  */
void LCD_DrawRGBImage(uint16_t Xpos, uint16_t Ypos, uint16_t Xsize, uint16_t Ysize, uint8_t *pdata)
{
  uint16_t x1, y1;
  
	if ( (Xpos > LCD_PIXEL_WIDTH) || (Ypos > LCD_PIXEL_HEIGHT)) return;
	x1 = Xpos + Xsize-1;
	y1 = Ypos + Ysize-1;
	if (x1 > LCD_PIXEL_WIDTH) x1 = LCD_PIXEL_WIDTH;
	if (y1 > LCD_PIXEL_HEIGHT) y1 = LCD_PIXEL_HEIGHT;

	LCD_DrawRGBImage_2P(Xpos, Ypos, x1, y1, pdata);
}

