IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
//====================================================
void LCD_DrawRGBbuffer(sImageBuf *pImageSt){
  uint16_t X0, Y0, X_most, Y_most, width, height;
 	
		DecomposeImStr(&X0, &Y0, &width, &height, &X_most, &Y_most, pImageSt);
		uint8_t *dataBuf = (uint8_t *) pImageSt->data;
		LCD_DrawRGBImage_2P(X0, Y0, X_most, Y_most, dataBuf);
}

void LCD_RectBuf_or_RectBack_skipRect(sImageBuf *imageSt, Point *skip_p, Point *Back_p);
//====================================================
void LCD_DrawRGBbuffer_skipRect(sImageBuf *pImageSt, Point *skip_p){
	LCD_RectBuf_or_RectBack_skipRect(pImageSt, skip_p, 0);
}

//====================================================
void LCD_FillRectBack_skipRect(Point *DrawB_p, Point *skip_p){
	LCD_RectBuf_or_RectBack_skipRect(0, skip_p, DrawB_p);
}

//====================================================
void LCD_RectBuf_or_RectBack_skipRect(sImageBuf *pImageSt, Point *skip_p, Point *Back_p){
  uint16_t X0, Y0, X_most, Y_most, width=0, height;
  uint16_t *pBuffer;
  uint16_t SKx0=0, SKy0=0, SKx1=0, SKy1=0;
  uint16_t Tcolor;
	
	if ((pImageSt == 0) && (Back_p==0)) return;
	if (pImageSt) {
		DecomposeImStr(&X0, &Y0, &width, &height, &X_most, &Y_most, pImageSt);
		pBuffer = pImageSt->data;
	} else { // Back_p != 0: Draw the background color on the rectangle range: Back_p[0] ~ Back_p[2]
			X0 = Back_p[0].X; 
			Y0 = Back_p[0].Y;
			X_most = Back_p[1].X; 
			Y_most = Back_p[1].Y;	
			if	((X_most < X0) || (Y_most < Y0)  ) 	return;
			Tcolor = DrawProp.BackColor;
			DrawProp.TextColor = DrawProp.BackColor;
			pBuffer = 0;
	}
	
	uint8_t w1 = 1;
	if (skip_p){		// having skip rectangle:  skip_p[0] ~ skip_p[2]
			SKx0 = skip_p[0].X; 
			SKy0 = skip_p[0].Y;
			SKx1 = skip_p[1].X; 
			SKy1 = skip_p[1].Y;	
		if	((SKx1 < SKx0) || (SKy1 < SKy0)  ) 	return;
	//-------------------------
	//	make sure that
	//	X0 <= SKx0 <= SKx1 <= X_most
	//	Y0 <= SKy0 <= SKy1 <= y_most
	//	min_y1 = min(y1, SKy1) = SKy1
	//-------------------------
		if (adjust_x1_less_x2_inRange(&SKx0, &SKx1, X0, X_most) ) {
			adjust_x1_less_x2_inRange(&SKy0, &SKy1, Y0, Y_most);
		} else w1 = 0;
	} else w1 = 0; 	// when skip_p = 0, no skip rectangle
	
			// no skip rectangle
	uint8_t *dataBuf = (uint8_t *) pBuffer;
	if (w1 == 0){		// no intersection (overlapping)
		LCD_DrawRGBImage_2P(X0, Y0, X_most, Y_most, dataBuf);
		if (!pImageSt) 	DrawProp.TextColor = Tcolor;
		return;
	}

			// having skip rectangle
	//====== Part 1: Y0 <= .... < SKy0
	if (Y0 < SKy0){
		LCD_DrawRGBImage_2P(X0, Y0, X_most, SKy0-1, dataBuf);	// (x0, y0) ~ (x1, SKy0-1)
		if (pImageSt) pBuffer += width * (SKy0 - Y0);
	}

	//=== Part 2: SKy0 <= ..... <= SKy1 (= min(SKy1, Y_most) = min_y1), since Y_most >= SKy1 definitely (if (SKy1 > Y_most) SKy1 = Y_most;	)
	// Note: Here always Y0 <= SKy0 <= SKy1 <= Y_most
//	w1 = SKx0 - X0;		// w1 > 0
	uint16_t i = 0, x0, x1;
		if (SKx0 > X0){ 
		//---------- Left subpart: x0 <= ... < SKx0
			x0 = X0; 
			x1 = SKx0-1;
			if (pImageSt)	dataBuf = (uint8_t *) pBuffer;
		} else i = 1; //i=1: not do left subpart
	for (; i <= 1; i++) {
		if (i == 1){
		//----------- Right subpart: SKx1 < ... <=x1 (NOT include SKx1)
			if (X_most <= SKx1) break;
			x0 = SKx1+1;
			x1 = X_most;
			if (pImageSt) dataBuf = (uint8_t *) pBuffer + 2 * (x0 - X0);
		}			

		if (pImageSt){	
				for(uint16_t y= SKy0; y <= SKy1; y++)
				{	
					LCD_DrawRGBImage_2P(x0, y, x1, y, dataBuf);
					dataBuf += 2 * width;
				}
		} else 		LCD_FillRect2P(x0, SKy0, x1, SKy1); 	// (x0, SKy0) ~ (x1, SKy1)
	}
	

	//====== Part 3: min_y1+1 (= SKy1+1) <= .... <= Y_most
	if (Y_most > SKy1){
		if (pImageSt) pBuffer += width * (SKy1 - SKy0 + 1);  // height = (SKy1 - SKy0 + 1)
		LCD_DrawRGBImage_2P(X0, (SKy1+1), X_most, Y_most,  (uint8_t *) pBuffer);
	}
	
	if (!pImageSt) 	DrawProp.TextColor = Tcolor;
}


//============ added on 07.03. 2025 ==========================
void LCD_DrawRGB_Transparent(uint16_t Xpos, uint16_t Ypos, uint16_t Xsize, uint16_t Ysize, uint8_t *pdata, uint16_t transColor)
{
  uint16_t x1, y1;
  uint16_t i, j;
	uint8_t transTrue = 0;	// not a transparent pixel
//	#define transColor WHITE  
		uint8_t	updated_2C=0;
	
	if ( (Xpos > LCD_PIXEL_WIDTH) || (Ypos > LCD_PIXEL_HEIGHT)) return;
	x1 = Xpos + Xsize-1;
	y1 = Ypos + Ysize-1;
	if (x1 > LCD_PIXEL_WIDTH){
		Xsize = LCD_PIXEL_WIDTH+1 - Xpos;
		x1 = LCD_PIXEL_WIDTH;
	}
	if (y1 > LCD_PIXEL_HEIGHT){
		Ysize = LCD_PIXEL_HEIGHT+1 - Ypos;
		y1 = LCD_PIXEL_HEIGHT;
	}
  
  LCD_DisplayWindow_WnH(Xpos, Ypos, Xsize, Ysize);

  for(j= 0; j < Ysize; j++)
  {
		uint16_t pixel;
		uint16_t xx, yy;
		
		if (updated_2C == 1){
			updated_2C = 0;
			transTrue = 1;
		}

		for(i= 0; i < Xsize; i++)
		{
			pixel = *(volatile uint16_t *)pdata;
			if (pixel != transColor){
				if ((transTrue == 1)){
					xx = i+Xpos;
					LCD_WriteReg(0x2A);					// Column Address Set (2Ah)
					LCD_WriteData(xx>>8);
					LCD_WriteData(0x00FF&xx);		
					LCD_WriteData(x1>>8);
					LCD_WriteData(0x00FF&x1);
					if (updated_2C == 0){
						yy = j + Ypos;
						LCD_WriteReg(0x2B);				// Page (Row) Address Set (2Bh) 
						LCD_WriteData(yy>>8);
						LCD_WriteData(0x00FF&yy);		
						LCD_WriteData(y1>>8);
						LCD_WriteData(0x00FF&y1);
					}
					LCD_WriteReg(0x2C);				// Write Data to GRAM (2Ch) 
					// NOTE:  Hereafer, the column register and the page register are reset 
					//        to the START Column/START Page positions.
					updated_2C = 1;

					transTrue = 0;
				}
    /* Write 16-bit GRAM Reg */
				LCD_WriteData(pixel);
			} else {
					transTrue = 1;
			}
			pdata += 2;
		}
	}
}

/**
  * @brief  Displays an poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @retval None
  */
void LCD_PolyLineClosed(pPoint p, uint16_t pCount, uint8_t Closed)
{
  uint16_t X, Y;
  pPoint First = p;

  if(pCount < 2)
  {
    p++;
    X = p->X;
    Y = p->Y;
    LCD_DrawLine(First->X, First->Y, X, Y);
    return;
  }

  while(--pCount)
  {
		uint16_t x0, y0;
    x0 = p->X;
    y0= p->Y;
    p++;
    X = p->X;
    Y = p->Y;
    LCD_DrawLine(x0, y0, X, Y);
	}
 
