IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
  if(Closed)   LCD_DrawLine(First->X, First->Y, X, Y);
}

/**
  * @brief  Displays an relative poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @param  Closed: specifies if the draw is closed or not.
  *           1: closed, 0 : not closed.
  * @retval None
  */
static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint8_t Closed)
{
  uint16_t X = 0, Y = 0;
  pPoint First = Points;

  if(PointCount < 2)
  {
    return;
  }
  X = Points->X;
  Y = Points->Y;
  while(--PointCount)
  {
    Points++;
    LCD_DrawLine(X, Y, X + Points->X, Y + Points->Y);
    X = X + Points->X;
    Y = Y + Points->Y;
  }
  if(Closed)   LCD_DrawLine(First->X, First->Y, X, Y);
}

/**
  * @brief  Displays a closed poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @retval None
  */
//void LCD_DrawPolygon(pPoint Points, uint16_t PointCount)
//{
////  LCD_PolyLine(Points, PointCount);
////  LCD_DrawLine(Points->X, Points->Y, (Points+PointCount-1)->X, (Points+PointCount-1)->Y);
//	LCD_PolyLineClosed(Points, PointCount, 1);
//}

/**
  * @brief  Displays a relative poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @retval None
  */
void LCD_PolyLineRelative(pPoint Points, uint16_t PointCount)
{
  LCD_PolyLineRelativeClosed(Points, PointCount, 0);
}

/**
  * @brief  Displays a closed relative poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @retval None
  */
void LCD_ClosedPolyLineRelative(pPoint Points, uint16_t PointCount)
{
  LCD_PolyLineRelativeClosed(Points, PointCount, 1);
}

/**
  * @brief  Draws an ellipse on LCD.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  XRadius: Ellipse X radius
  * @param  YRadius: Ellipse Y radius
  * @retval None
  */
void LCD_DrawEllipse(int Xpos, int Ypos, int XRadius, int YRadius)
{
  int x = 0, y = -YRadius, err = 2-2*XRadius, e2;
  float K = 0, rad1 = 0, rad2 = 0;
  
  rad1 = (float) XRadius;
  rad2 = (float) YRadius;
  
  K = (float)(rad2/rad1);
  
  do {      
    LCD_DrawPixel((Xpos-(uint16_t)(x/K)), (Ypos+y), DrawProp.TextColor);
    LCD_DrawPixel((Xpos+(uint16_t)(x/K)), (Ypos+y), DrawProp.TextColor);
    LCD_DrawPixel((Xpos+(uint16_t)(x/K)), (Ypos-y), DrawProp.TextColor);
    LCD_DrawPixel((Xpos-(uint16_t)(x/K)), (Ypos-y), DrawProp.TextColor);      
    
    e2 = err;
    if (e2 <= x) {
      err += ++x*2+1;
      if (-y == x && e2 <= y) e2 = 0;
    }
    if (e2 > y) err += ++y*2+1;     
  }
  while (y <= 0);
}


/**
  * @brief  Fills a triangle (between 3 points).
  * @param  Points: Pointer to the points array
  * @param  Points[0].x: Point 1 X position
  * @param  Points[0].y: Point 1 Y position
  * @param  Points[1].x: Point 2 X position
  * @param  Points[1].y: Point 2 Y position
  * @param  Points[2].x: Point 3 X position
  * @param  Points[2].y: Point 3 Y position
  * @retval None
  */
// revised on 2026/01/02
 void LCD_FillTriangle_RGBbuffer3P(pPoint P0, pPoint P1, pPoint P2, sImageBuf *pImageSt);

void LCD_FillTriangle(pPoint Points)
{
		LCD_FillTriangle_RGBbuffer3P(&Points[0], &Points[1], &Points[2], 0);
}
//===================================================================
void LCD_FillTriangle_RGBbuffer(pPoint Points, sImageBuf *pImageSt)
{
		LCD_FillTriangle_RGBbuffer3P(&Points[0], &Points[1], &Points[2], pImageSt);
}


//================================================================
/**
  * @brief  Draws a full poly-line (between many points).
  * @param  Points: Pointer to the points array
  * @param  PointCount: Number of points
  * @retval None
  */
void LCD_FillPolygon(pPoint Points, uint16_t PointCount)
{
  int16_t i;

  if(PointCount <=1) return;
  if(PointCount ==2) {
		uint16_t x, y;
    x = Points->X;
    y = Points->Y;
    Points++;
    LCD_DrawLine(x, y, Points->X, Points->Y);
		return;
  }

  for(i = 0; i < (PointCount-2); i++)
  {
		LCD_FillTriangle_RGBbuffer3P(&Points[0], &Points[i+1], &Points[i+2], 0);
  }
}

void LCD_DrawRGBbuffer_Transparent(sImageBuf *pImageSt, uint16_t transColor){
  uint16_t X0, Y0, width, height;
  uint8_t *pdataBuf;
	
	X0 = pImageSt->topLeft.X;
	Y0 = pImageSt->topLeft.Y;
	width = pImageSt->width;
	height = pImageSt->height;
	pdataBuf = (uint8_t *) pImageSt->data;
	LCD_DrawRGB_Transparent(X0, Y0, width, height, pdataBuf, transColor);
}

//================================================================
void LCD_FillPolygon_RGBbuffer(pPoint Points, uint16_t PointCount, sImageBuf *pImageSt)
{
  int16_t i;

  if(PointCount <=1) return;
  if(PointCount ==2)
  {
		uint16_t x, y;
    x = Points->X;
    y = Points->Y;
    Points++;
    LCD_DrawLine_RGBbuffer(x, y, Points->X, Points->Y, pImageSt);
		return;
  }

  for(i = 0; i < (PointCount-2); i++)
  {
		LCD_FillTriangle_RGBbuffer3P(&Points[0], &Points[i+1], &Points[i+2], pImageSt);
	}
}

/**
  * @brief  Draws a full ellipse.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  XRadius: Ellipse X radius
  * @param  YRadius: Ellipse Y radius  
  * @retval None
  */
void LCD_FillEllipse(int Xpos, int Ypos, int XRadius, int YRadius)
{
  int x = 0, y = -YRadius, err = 2-2*XRadius, e2;
  float K = 0, rad1 = 0, rad2 = 0;
  
  rad1 = XRadius;
  rad2 = YRadius;
  
  K = (float)(rad2/rad1);    
  
  do 
  { 
    LCD_DrawHLine((Xpos-(uint16_t)(x/K)), (Ypos+y), (2*(uint16_t)(x/K) + 1));
    LCD_DrawHLine((Xpos-(uint16_t)(x/K)), (Ypos-y), (2*(uint16_t)(x/K) + 1));
    
    e2 = err;
    if (e2 <= x) 
    {
      err += ++x*2+1;
      if (-y == x && e2 <= y) e2 = 0;
    }
    if (e2 > y) err += ++y*2+1;
  }
  while (y <= 0);
}


//============== NEW by Shir-Kuan Lin ++++++++++++
sFONT *lFont;
uint16_t	ltColor, lbColor;

//----------------------
void LCD_SaveColors(void)
{
	ltColor = DrawProp.TextColor;
	lbColor = DrawProp.BackColor;
}
//----------------------
void LCD_RestoreColors(void)
{
	DrawProp.TextColor = ltColor;
	DrawProp.BackColor = lbColor;
}
//----------------------
void LCD_SaveFont(void)
{
	lFont = pLCD_Currentfonts;
}
//----------------------
void LCD_RestoreFont(void)
{
  LCD_SetFont(lFont);
}
//---------------------------
// if no tail string "ptr": Use (char*)'\n' instead.
// For Example: LCD_digital(row_no, col_no, val,  (char*)'\n');
//---------------------------------
void LCD_digital(uint8_t row_no, uint8_t col_no, int16_t val, char *ptr)
{
  char p_text[6] = "";

	sprintf(p_text, "%i%s", val, ptr);  //% read a decimal, octal, or hexadecimal integer
	LCD_DisplayStringLineCol(row_no, col_no, p_text);
}

//########################################################
//########################################################
//  Test  Experiments 													 
//########################################################
//########################################################
void LCD_FillTriangleAA(Point p[3]);

/**
  * @brief  Test LCD Display
  * @retval None
  */
void LCD_RGB_Test(void)
{
  uint32_t index, p1, p;

  LCD_OpenWin(0, 0, LCD_PIXEL_WIDTH, LCD_PIXEL_HEIGHT);
	p = (LCD_PIXEL_HEIGHT+1)/3;
	p = p * (LCD_PIXEL_WIDTH+1);

	/* R */
  for(index = 0; index <= p; index++)
  {
    LCD_WriteData(LCD_COLOR_RED);
  }
	  
  /* G */
	p = 2 * p;
  for(; index <= p; index++)
  {
    LCD_WriteData(LCD_COLOR_GREEN);
  }
	  
