IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
	/* B */
	p = (LCD_PIXEL_HEIGHT+1)*(LCD_PIXEL_WIDTH+1);
  for(; index <= p; index++)
  {
    LCD_WriteData(LCD_COLOR_BLUE);
  }

	p1 = (DrawProp.pFont)->Height; // font_height in pixel;	
	p1 = ((LCD_PIXEL_HEIGHT+1) +(p1-1)) /p1;
	LCD_SetColors(WHITE, RED);
  LCD_DisplayStringLineCol(2, 1,"R"); // line 2, column 1
	p = p1/3;
	LCD_SetBackColor(GREEN);
  LCD_DisplayStringLineCol((uint8_t) (2+p), 1,"G"); // line , column 1
	p = (2*p1)/3;
	LCD_SetBackColor(BLUE);
  LCD_DisplayStringLineCol((uint8_t) (2+p), 1,"B"); // line , column 1
	  delay_ms(1000); /* delay 1000 ms */
}


//==========================
// LCD display off/on test 
//==========================
void LCD_DisplayOnTest(void)
{
	LCD_DisplayOff();

	delay_ms(3000);
 	//---- turn on Display ----------
	LCD_DisplayOn();
}


/**
  * @brief  Menu Initialisation routine
  */
#define point_Count 3
#define X_c	160
#define Y_c 215
#define H_R 9
void MenuInit(void)
{
  uint16_t wd;
	Point Points0[point_Count]={ 
		{(X_c-H_R+1), (Y_c-H_R)}, // Upper Left 
		{(X_c+H_R+1), (Y_c)}, 		// Right Center
		{(X_c-H_R+1), (Y_c+H_R)}, // Down Left
	};
	Point Points1[point_Count]={ 
//		{(X_c+2*H_R+1), (Y_c-H_R)}, // Upper Right
////		{(X_c+H_R+1), (Y_c)}, 		// Left Center
////		{(X_c+2*H_R+1), (Y_c+H_R)}, // Down Right
		{180, 210}, {210, 214}, {226, 226}
	};

	
	LCD_RGB_Test();
	delay_ms(200);

	/*	save current Font, Back Color*/
	LCD_SaveColors();

	LCD_SaveFont();
//	LCD_SetFont(&Font20);
  LCD_Clear(LCD_COLOR_BLUE2);
	LCD_SetColors(LCD_COLOR_MAGENTA, LCD_COLOR_BLUE2); // Test = white; back = blue

	LCD_DisplayStringLineCol(0, 2,"PARADIGM LCD DEMO");		// line 0, column 2
  LCD_SetTextColor(LCD_COLOR_GREEN);
  LCD_DisplayStringLineCol(2, 1,"Watch LEDs flashing"); // line 2, column 1

	//----------------------------------
	if (LANDSCAPE == 0) wd = 184;
	else	wd = 220;
  LCD_SetTextColor(LCD_COLOR_YELLOW);
  /*Draw a rectangle with: Start X-Cood,  Start Y-Cood,  Width,  Heigt*/
  LCD_DrawRect(50,80,wd,120);
  LCD_SetTextColor(LCD_COLOR_CYAN);
  /*Draw a rectangle with: Start X-Cood,  Start Y-Cood,  Width,  Heigt*/
  LCD_DrawRect(45,75,wd+10,130);
  /*Draw a triangle with: Start X-Cood,  Start Y-Cood,  Width,  Heigt*/
		LCD_FillTriangle(Points0);
		LCD_DrawPolygon(Points1,  3);
		LCD_SetTextColor(RED);
		LCD_FillTriangle(Points1);
		LCD_SetTextColor(WHITE);
		LCD_DrawPolygon(Points0,  3);
		LCD_DrawPolygon(Points1,  3);
	//----------------------------------
  LCD_SetTextColor(LCD_COLOR_RED);
	LCD_FillRect(53, 83, wd-6, 114);
	LCD_SetTextColor(LCD_COLOR_WHITE);
  LCD_DisplayStringLineCol(5, 4, "Value:");
	LCD_DrawCircle(160, 160, 30);
  LCD_SetTextColor(LCD_COLOR_GREEN);
	LCD_FillCircle(160, 160, 26);


	/*	restore last Font, Back Color*/
	LCD_RestoreFont();
	LCD_RestoreColors();
	
	delay_ms(2000);
	ReverseLCD();
	delay_ms(4000);
	NormalLCD();

	delay_ms(2000);
	LCD_DisplayOnTest();
}


/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/


/**
  * @brief  Reads RGB Image (16 bpp).
  * @param  Xpos:  X position in the LCD
  * @param  Ypos:  Y position in the LCD
  * @param  Xsize: X size in the LCD
  * @param  Ysize: Y size in the LCD
  * @param  pdata: Pointer to the RGB Image address.
  * @retval None
  */
void LCD_ReadRGBImage(uint16_t Xpos, uint16_t Ypos, uint16_t Xsize, uint16_t Ysize, uint8_t *pdata)
{
  uint16_t index, size;
  uint16_t x1, y1;
	volatile uint16_t data1, data2;
  
	if (Xpos > LCD_PIXEL_WIDTH){
		Xpos = LCD_PIXEL_WIDTH;
		if (Ypos > LCD_PIXEL_HEIGHT) return;
	}
	if (Ypos > LCD_PIXEL_HEIGHT) Ypos = LCD_PIXEL_HEIGHT;
	x1 = Xpos + Xsize-1;
	y1 = Ypos + Ysize-1;
	if (x1 > LCD_PIXEL_WIDTH) Xsize = LCD_PIXEL_WIDTH+1 - Xpos;
	if (y1 > LCD_PIXEL_HEIGHT) Ysize = LCD_PIXEL_HEIGHT+1 - Ypos;
  LCD_DisplayWindow_WnH(Xpos, Ypos, Xsize, Ysize);

	LCD_WriteReg(0x2E);	// 0x2E: Memory Read
	//delay_ms(1);
  size = (Xsize * Ysize);
	LCD_ReadData;   // the 1st return value is "dummy"

  for(index = 0; index < (size/2); index++)
	{
 		data1 = LCD_ReadData;							// data1[15:11] = RED1[4:0]; data1[7:2] = GREED1[5:0]
		data1 = (data1 & 0xF800) | ((data1<<3) & 0x07E0);
 		data2 = LCD_ReadData;							// data2[15:11] = BLUE1[4:0]; data1[7:3] = RED2[4:0]
		
 		*((volatile uint16_t *) pdata)= data1 | (data2>>11);
     pdata += 2;
		data1 = (data2<<8) & 0xF800;
 		data2 = LCD_ReadData;							// data2[15:10] = GREEN2[5:0]; data1[7:3] = BLUE2[4:0]
		data1 = data1 | ((data2>>5) & 0x07E0) | ((data2>>3) & 0x001F);
 		*((volatile uint16_t *) pdata)= data1;
     pdata += 2;
	}
	
	if( size & 0x01 )	// size is an odd integer
	{
 		data1 = LCD_ReadData;
		data1 = (data1 & 0xF800) | ((data1<<3) & 0x07E0);
 		data2 = LCD_ReadData;
		
 		*((volatile uint16_t *) pdata)= data1 | (data2>>11);
	}
}

//?????????????????
//################## Low LEVEL DRIVER
/**
  * @brief  Reads the selected LCD Register.
  * @param  LCD_Reg: address of the selected register.
  * @retval LCD Register Value.
  */

//=========== 2026.01.02 ===========================
//--------------------------------------------------
static void Swap(Point* a, Point* b)
{
    Point t = *a;
    *a = *b;
    *b = t;
}

//------------------------------------------------
static void parameters_flatTri(uint16_t dyL, int16_t dxL, uint16_t *abs_dxL, int16_t *rL, int16_t *inc_xL)
{
	*abs_dxL = ABS(dxL);
	*rL = (dyL >= *abs_dxL) ? dyL / 2 : -*abs_dxL/2;
	*inc_xL = (dxL >= 0) ? 1 : -1;	
}	
//-----------------------------------------------------
static int16_t r_And_x_int(int16_t *r, int16_t *x_int, uint16_t dy, uint16_t abs_dx, int16_t inc_x)			
{
		*r += abs_dx;
		while (*r >= dy) {
			*r -= dy;
			*x_int += inc_x;		// 1 for dxL > 0; -1 for dxL < 0.
		}
		return *x_int;
}

//----------------------------------------------------------
static void flatTop_parameters(uint16_t *dy, int16_t *dx, uint16_t *x_lmt, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)	
{
			*dy = y2 - y1;  // dyL > 0
			*dx = x2 - x1;
			*x_lmt = x2;
}
	//====== Flat Bottom triangle 
	//      (x0, y0) o 
	//                 \   \
	//        (x1, y1) o----o (x2, y2)
	//====== Flat Top triangle 
	//      (x0, y0) o----o (x1, y1)
	//                 \  \
	//                      o (x2, y2)
static void flatTriangles(Point v0, Point v1, Point v2)
{ // v1.Y = v2.Y > v0.Y
	uint16_t y0 = v0.Y, y1 = v1.Y, y2 = v2.Y;		// y0 < y1 <= y2 
	uint16_t x0 = v0.X, x1 = v1.X, x2 = v2.X;	// x1 <= x2
	
