IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
	uint16_t dyL, dyR;
	int16_t dxL, dxR;
	int16_t xL, xR, xL_int, xR_int;
	uint16_t xL_lmt, xR_lmt;
	uint8_t left_Line01;
	uint16_t y, ys = y0, ye;
	xL = xL_int = x0; 
	xR = xR_int = x0;
	dyR = y2 - y0;  // dyR > 0
	dxR = x2 - x0;

	if (y0 == y1) {
			//-- Flat Top triangle 
		// x1 < x0: Left side = Line 12; Right side = Line 02
		flatTop_parameters(&dyL, &dxL, &xL_lmt, x1, y1, x2, y2);
		xR_lmt = xL_lmt;
		xL = xL_int = x1;
		ye = y2;		// flat top: y0 ~ y2, y1 = y0;
	} else {		// if y0 != y1
			//-- Flat Bottom triangle 
		ye = (y2 > y1) ? y1-1 : y1;		// flat bottom: y0 ~ (y1-1); flat top: y1 ~ y2;
			dyL = y1 - y0;
			dxL = x1 - x0;
			int32_t L_slope = (dxL << 16) / dyL;
			int32_t R_slope = (dxR << 16) / dyR;
		if (L_slope == R_slope){
			LCD_DrawLine(x0, y0, x2, y2);		// a single general line instead
			return;
		} 		
		if (L_slope > R_slope){
			// Left side = Line 02; Right side = Line 01 
			left_Line01 = 0;
			swap_u16(&dyL, &dyR);
			swap_i16(&dxL, &dxR);
			xR_lmt = x1;
			xL_lmt = x2;
		} else {
			// Left side = Line 01; Right side = Line 02 
			left_Line01 = 1;
			xR_lmt = x2;
			xL_lmt = x1;
		}
	}

	uint16_t abs_dxL, abs_dxR;
	int16_t rL, rR, inc_xL, inc_xR;
	parameters_flatTri(dyL, dxL, &abs_dxL, &rL, &inc_xL);
	parameters_flatTri(dyR, dxR, &abs_dxR, &rR, &inc_xR);

loop_start:
		for (y=ys; y<=ye; y++)
		{
			int16_t tL, tR;
			tL = r_And_x_int(&rL, &xL_int, dyL, abs_dxL, inc_xL);			
			if (abs_dxL > dyL) {
				// r == 0 ==> dx> 0, xR = x-1;     dx <0, xL = x+1
				// r != 0 ==> dx> 0, xR = x, x++;  dx <0, xL = x, x--;
				if (dxL >= 0) {
						if (rL != 0) tL++;
				} else	{	// (dxL < 0)
						if (rL == 0) xL = tL + 1;
						else				 xL = tL--;
						if (xL < xL_lmt) xL = xL_lmt;
				}
			}

			tR = r_And_x_int(&rR, &xR_int, dyR, abs_dxR, inc_xR);			
			if (abs_dxR > dyR) {
				// r == 0 ==> dx> 0, xR = x-1;     dx <0, xL = x+1
				// r != 0 ==> dx> 0, xR = x, x++;  dx <0, xL = x, x--;
				if (dxR >= 0) {
						if (rR == 0) xR = tR - 1;
						else				 xR = tR++;
						if (xR > xR_lmt) xR = xR_lmt;
				} else {		// (dxR < 0)
						if (rR != 0) tR--;
				}
			}
			
			LCD_DrawHLine2P( xL, y, xR, y);		// horizontal line
			xL = tL; xR = tR;
    }
//loop_end:
		if (y > y2) return;
		
			//-- Flat Top triangle 
		ys = y1; ye = y2;

		if(left_Line01) {
			// Left side is update as Line 12;
			flatTop_parameters(&dyL, &dxL, &xL_lmt, x1, y1, x2, y2);
			parameters_flatTri(dyL, dxL, &abs_dxL, &rL, &inc_xL);
			xL = xL_int = x1;
		} else {
			// Right side is update as Line 12;
			flatTop_parameters(&dyR, &dxR, &xR_lmt, x1, y1, x2, y2);
			parameters_flatTri(dyR, dxR, &abs_dxR, &rR, &inc_xR);
			xR = xR_int = x1;
		}
		goto loop_start;
}

//==========================
/**
  * @brief  Fills a triangle (between 3 points).
  * @param  Points: Pointer to the points array
  * @retval None
  */
void LCD_FillTriangleAA(Point p[3])
{
    Point v0 = p[0];
    Point v1 = p[1];
    Point v2 = p[2];

    // Sort by Y s.t. v0.Y <= v1.Y <= v2.Y
    if (v0.Y > v1.Y) Swap(&v0, &v1);
    if (v1.Y > v2.Y) Swap(&v1, &v2);	// ==> v2.Y is the largest
    if (v0.Y > v1.Y) Swap(&v0, &v1);	// ==> v0.Y is the smallest
	uint16_t	x0, y0, x1, y1, x2, y2;
		x0 = v0.X;
		y0 = v0.Y;
		x1 = v1.X;
		y1 = v1.Y;
		x2 = v2.X;
		y2 = v2.Y;

   // Degenerate (H or V line)
		if ((x0 == x1) && (x0 == x2)) {
			LCD_DrawVLine2P( x0, y0, x0, y2);		// vertical line xL = xR
      return;
		}
		uint16_t dy = y2 -y0;
    if (dy == 0) {
      uint16_t xL = x0, xR = x0;
      if (x1 < xL) xL = x1;
      if (x2 < xL) xL = x2;
      if (x1 > xR) xR = x1;
      if (x2 > xR) xR = x2;
			LCD_DrawHLine2P( xL, y0, xR, y0);		// horizontal line, y0=y2; 
      return;
    }
		
		//-- Flat Top triangle 
		if (y0 == y1) {
			if (x0 == x1)  LCD_DrawLine(x0, y0, x2, y2);		// a single general line instead
			else {
				if (x0 >= x1)	flatTriangles(v0, v1, v2);	// x1 <= x0: Left side = Line 12; Right side = Line 02
				else					flatTriangles(v1, v0, v2);	// x1 > x0: Left side = Line 02; Right side = Line 12
			}
			return;
		}
	
   // General -> Flat-bottom + Flat-top
		flatTriangles(v0, v1, v2);
}

static void 	keep_ys_to_Y0(int16_t *rL, int16_t *xL_int, int16_t *xL, uint16_t Y0_ys, int16_t dxL, uint16_t dyL)
{
	uint16_t abs_dxL = ABS(dxL);
	int16_t	inc_xL = (dxL >= 0) ? 1 : -1;	

					*rL = *rL + abs_dxL * (Y0_ys);
					*xL_int += inc_xL * (*rL / dyL);
					*rL = *rL % dyL;
					*xL = *xL_int;	
					if (abs_dxL > dyL) {
						if (*rL != 0){
							if (dxL >= 0)  *xL += 1;
							else					 *xL -= 1;	
						}						
					} 
}

//==================================================================================
static void flatTriangles_inBuffer(Point v0, Point v1, Point v2, sImageBuf *pImageSt)
{ // v1.Y = v2.Y > v0.Y
	uint16_t y0 = v0.Y, y1 = v1.Y, y2 = v2.Y;		// y0 < y1 <= y2 
	uint16_t x0 = v0.X, x1 = v1.X, x2 = v2.X;	// x1 <= x2
	
	//>>>>----------------------------------------------
			uint16_t X0, Y0, width, height;
			uint16_t X_most, Y_most;
			uint16_t *pBuffer;
			uint16_t	Tcolor = DrawProp.TextColor;
		if (pImageSt){  // fill in the image buffer
			DecomposeImStr(&X0, &Y0, &width, &height, &X_most, &Y_most, pImageSt);
			pBuffer = pImageSt->data;
			if ( (y2 < Y0) || (y0 > Y_most) ) return; // out of the buffer range
		} 	
	//<<<<---------------------------------------------

	uint16_t dyL, dyR;
	int16_t dxL, dxR;
	int16_t xL, xR, xL_int, xR_int;
	uint16_t xL_lmt, xR_lmt;
	uint8_t left_Line01;
	uint16_t y, ys = y0, ye;
	xL = xL_int = x0; 
	xR = xR_int = x0;
	dyR = y2 - y0;  // dyR > 0
	dxR = x2 - x0;

	if (y0 == y1) {
			//-- Flat Top triangle 
		// x1 < x0: Left side = Line 12; Right side = Line 02
		flatTop_parameters(&dyL, &dxL, &xL_lmt, x1, y1, x2, y2);
		xR_lmt = xL_lmt;
		xL = xL_int = x1;
		ye = y2;		// flat top: y0 ~ y2, y1 = y0;
	} else {		// if y0 != y1
			//-- Flat Bottom triangle 
		ye = (y2 > y1) ? y1-1 : y1;		// flat bottom: y0 ~ (y1-1); flat top: y1 ~ y2;
			dyL = y1 - y0;
			dxL = x1 - x0;
			int32_t L_slope = (dxL << 16) / dyL;
			int32_t R_slope = (dxR << 16) / dyR;
		if (L_slope == R_slope){
				if (pImageSt) LCD_DrawLine_RGBbuffer(x0, y0, x2, y2, pImageSt);
				else					LCD_DrawLine(x0, y0, x2, y2);		
			return;
		} 		
		if (L_slope > R_slope){
			// Left side = Line 02; Right side = Line 01 
			left_Line01 = 0;
			swap_u16(&dyL, &dyR);
			swap_i16(&dxL, &dxR);
			xR_lmt = x1;
			xL_lmt = x2;
		} else {
			// Left side = Line 01; Right side = Line 02 
			left_Line01 = 1;
			xR_lmt = x2;
			xL_lmt = x1;
		}
	}

	uint16_t abs_dxL, abs_dxR;
	int16_t rL, rR, inc_xL, inc_xR;
	parameters_flatTri(dyL, dxL, &abs_dxL, &rL, &inc_xL);
	parameters_flatTri(dyR, dxR, &abs_dxR, &rR, &inc_xR);

		if (pImageSt) {
			if (ye < Y0){
				//-- Flat Top triangle 
				if (left_Line01)	keep_ys_to_Y0(&rR, &xR_int, &xR, ye-ys, dxR, dyR);
				else							keep_ys_to_Y0(&rL, &xL_int, &xL, ye-ys, dxL, dyL);
				goto loop_end;
			} 
		}

uint16_t y_m_Y0_width;		
loop_start:
		if (pImageSt) {
			if (ye > Y_most) ye = Y_most;
			if ((ye >= Y0) && (ys < Y0) ) {
					keep_ys_to_Y0(&rL, &xL_int, &xL, Y0-ys, dxL, dyL);
					keep_ys_to_Y0(&rR, &xR_int, &xR, Y0-ys, dxR, dyR);
					ys = Y0;	
			}
			y_m_Y0_width = (ys - Y0) * width;
		} 	

		for (y=ys; y<=ye; y++)
		{
			int16_t tL, tR;
			tL = r_And_x_int(&rL, &xL_int, dyL, abs_dxL, inc_xL);			
			if (abs_dxL > dyL) {
				// r == 0 ==> dx> 0, xR = x-1;     dx <0, xL = x+1
				// r != 0 ==> dx> 0, xR = x, x++;  dx <0, xL = x, x--;
				if (dxL >= 0) {
						if (rL != 0) tL++;
				} else	{	// (dxL < 0)
						if (rL == 0) xL = tL + 1;
						else				 xL = tL--;
						if (xL < xL_lmt) xL = xL_lmt;
				}
			}

