IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
			tR = r_And_x_int(&rR, &xR_int, dyR, abs_dxR, inc_xR);			
			if (abs_dxR > dyR) {
				// r == 0 ==> dx> 0, xR = x-1;     dx <0, xL = x+1
				// r != 0 ==> dx> 0, xR = x, x++;  dx <0, xL = x, x--;
				if (dxR >= 0) {
						if (rR == 0) xR = tR - 1;
						else				 xR = tR++;
						if (xR > xR_lmt) xR = xR_lmt;
				} else {		// (dxR < 0)
						if (rR != 0) tR--;
				}
			}
			
	//>>>>----------------------------------------------
			if (pImageSt){	 // fill in the image buffer at row Yp
				uint16_t xEnd, xIni, offset;
				if ( (xR >= X0) && (xL <= X_most)){
					xEnd = xR;
					xIni = xL; 
					// draw only when column >= X0
					if (xEnd > X_most) xEnd = X_most;
					if (xIni < X0)	xIni = X0;
					offset = y_m_Y0_width;		// Yp >= Y0	
					offset += (xIni-X0);			// note, x_tmp >=X0;
					// row y:  xIni.....  xEnd
					for (uint16_t j = xIni; j <= xEnd; j++){	// do only when x1 >= x_initial >= X0  > 0
						pBuffer[offset++] = Tcolor;
					}
				}
				y_m_Y0_width += width;
			}			// END of if (pImageSt)
	//<<<<---------------------------------------------
			else 		LCD_DrawHLine2P( xL, y, xR, y);		// horizontal line
				
			xL = tL; xR = tR;
    }
		if (y > y2) return;
		if (pImageSt){	
			if (y > Y_most) return;
		}

loop_end:	
			//-- Flat Top triangle 
		ys = y1; ye = y2;

		if(left_Line01) {
			// Left side is update as Line 12;
			flatTop_parameters(&dyL, &dxL, &xL_lmt, x1, y1, x2, y2);
			parameters_flatTri(dyL, dxL, &abs_dxL, &rL, &inc_xL);
			xL = xL_int = x1;
		} else {
			// Right side is update as Line 12;
			flatTop_parameters(&dyR, &dxR, &xR_lmt, x1, y1, x2, y2);
			parameters_flatTri(dyR, dxR, &abs_dxR, &rR, &inc_xR);
			xR = xR_int = x1;
		}
		goto loop_start;
}

//===================================================================
void LCD_FillTriangle_RGBbuffer3P(pPoint P0, pPoint P1, pPoint P2, sImageBuf *pImageSt)
{
    Point v0 = *P0;
    Point v1 = *P1;
    Point v2 = *P2;

    // Sort by Y s.t. v0.Y <= v1.Y <= v2.Y
    if (v0.Y > v1.Y) Swap(&v0, &v1);
    if (v1.Y > v2.Y) Swap(&v1, &v2);	// ==> v2.Y is the largest
    if (v0.Y > v1.Y) Swap(&v0, &v1);	// ==> v0.Y is the smallest
	uint16_t	x0, y0, x1, y1, x2, y2;
  		x0 = v0.X;
		y0 = v0.Y;
		x1 = v1.X;
		y1 = v1.Y;
		x2 = v2.X;
		y2 = v2.Y;

   // Degenerate (H or V line)
		if ((x0 == x1) && (x0 == x2)) {
		uint8_t HLine = 0;
			// Vertical Line	(x0 = x1 = x2)
			if (pImageSt)	draw_HVline_inBuffer(HLine, x0, y0, x0, y2, pImageSt);	// HLine = 0: vertical line: x0 = x1 = x2
			else 					LCD_DrawVLine2P( x0, y0, x0, y2);		// vertical line xL = xR = x0
			return;
		}
		uint16_t dy = y2 -y0;
    if (dy == 0) {
			// Horizontal Line	(y0 = y1 = y2)
			uint8_t HLine = 1;
			uint16_t xL = x0, xR = x0;
      if (x1 < xL) xL = x1;
      if (x2 < xL) xL = x2;
      if (x1 > xR) xR = x1;
      if (x2 > xR) xR = x2;
			if (pImageSt)	draw_HVline_inBuffer(HLine, xL, y0, xR, y0, pImageSt);	// HLine = 1: horizontal line, y0= y1 = y2;
			else 					LCD_DrawHLine2P( xL, y0, xR, y0);		// horizontal line, y0=y2; 
      return;
    }

		//-- Flat Top triangle 
		if (y0 == y1) {
			if (x0 == x1) {	// a single general line instead
				if (pImageSt) LCD_DrawLine_RGBbuffer(x0, y0, x2, y2, pImageSt);
				else					LCD_DrawLine(x0, y0, x2, y2);		
			}
			else {
				if (x0 < x1)	Swap(&v0, &v1);
				// x1 <= x0: Left side = Line 12; Right side = Line 02
				// x1 > x0: Left side = Line 02; Right side = Line 12 ==> Left = new Line 12; Right  = new Line 02
				if (pImageSt)	flatTriangles_inBuffer(v0, v1, v2, pImageSt);	
				else					flatTriangles(v0, v1, v2);	
			}
			return;
		}
	
		   // General -> Flat-bottom + Flat-top
		if (pImageSt)	flatTriangles_inBuffer(v0, v1, v2, pImageSt);
		else					flatTriangles(v0, v1, v2);
}


/* //-----------------------------------------------------------------------
//===================================================================
void LCD_FillTriangle_RGBbuffer3(pPoint P0, pPoint P1, pPoint P2, sImageBuf *pImageSt)
{
	uint16_t	xp[3], yp[3], i, tmp, x02_mid;
	uint16_t	deltaY1, deltaY2, deltaY12;
  int32_t int_tmp, deltaX1, deltaX2;
  uint16_t x, y, x1, y1;
	uint16_t	Tcolor = DrawProp.TextColor;
	
	//>>>>----------------------------------------------
			uint16_t X0, Y0, width, height;
			uint16_t *pBuffer;
			uint16_t X_most, Y_most;
			uint32_t	offset;
		if (pImageSt){  // fill in the image buffer
			X0 = pImageSt->topLeft.X;
			Y0 = pImageSt->topLeft.Y;
			width = pImageSt->width;
			height = pImageSt->height;
			X_most = X0 + width - 1;
			Y_most = Y0 + height - 1;
			pBuffer = pImageSt->data;
		} 	
	//<<<<---------------------------------------------
		if ((P0 == 0) || (P1 == 0) || (P2 == 0)) return;
		xp[0] = P0->X;
		yp[0] = P0->Y;
		xp[1] = P1->X;
		yp[1] = P1->Y;
		xp[2] = P2->X;
		yp[2] = P2->Y;
		for (i=1; i<3; i++)
		{
			if (yp[0] > yp[i]){
					tmp = xp[i];
				xp[i] = xp[0];
				xp[0] = tmp;
					tmp = yp[i];
				yp[i] = yp[0];
				yp[0] = tmp;
			}
		}	// yp[0] is the smallest value
		if (yp[1] > yp[2]){
					tmp = xp[1];
				xp[1] = xp[2];
				xp[2] = tmp;
					tmp = yp[1];
				yp[1] = yp[2];
				yp[2] = tmp;
		}
		//<<<------------------------------------------------

	// NOTE: Now yp[2] >= yp[1] >= yp[0]
	//----------
	// Point 0 with smallest y; 
	// Point 1 at the middle height
	// Point 2 with largest y
	//------------ 
  deltaX2 = (int32_t) xp[2]- xp[0];		// Line 0_2 is a vertical line
  deltaX1 = (int32_t) xp[1]- xp[0];		// Line 0_1	is a vertical line
	x = xp[0];
	y = yp[0];
	if (deltaX1 == 0 && deltaX2 == 0 ){	// a vertical line ONLY
		if (pImageSt == 0){  // no image buffer
			tmp = yp[2] - y;
			LCD_DrawVLine(x, y, tmp+1);	// a vertical line ONLY
		} else 
	//>>>>----------------------------------------------
		{	 // fill in the image buffer
			if ((x < X0) || (x > X_most)) return;
			if (y < Y0) y = Y0;			// initial row
			y1 = yp[2];						// end row
			if (y1 > Y_most) y1 = Y_most;
			offset = (y-Y0) * width + (x-X0);			// note x >=X0;
			for (uint16_t j = y; j <= y1; j++){		// do only when y1 >= y >= Y0
				pBuffer[offset] = Tcolor;
				offset += width;
			}
		}
	//<<<<---------------------------------------------
		return;		// a vertical line ONLY
	}

	//------------ 
	deltaY2 = (int32_t) yp[2]- yp[0];		// note: deltaY2 >= 0
	if (deltaY2 == 0){	// i.e. 0 = deltaY2 >= deltaY1 >= 0: a horizontal line ONLY
			if( xp[2] < xp[0]){ 
				x = xp[2];
				tmp = xp[0] - x;
			} else {
				tmp = xp[2] - x;
			}
		if (pImageSt == 0){  // no image buffer
			LCD_DrawHLine(x, y, tmp+1);	// a horizontal line
		} else 
	//>>>>----------------------------------------------
		{	 // fill in the image buffer
			if ((y < Y0) || (y > Y_most)) return;
			x1 = tmp + x;						// i.e., xp[0] or xp[2]: end column
			if (x < X0) x = X0;			// initial column
			if (x1 > X_most) x1 = X_most;
			offset = (y-Y0) * width + (x-X0);			// note x >=X0;
			for (uint16_t j = x; j <= x1; j++){		// do only when x1 >= x >= X0
				pBuffer[offset++] = Tcolor;
			}
		}
	//<<<<---------------------------------------------
			return;		// a horizontal line ONLY
	}
	
	// ---------- deltaY2 (yp[2]- yp[0]) > 0 in the following --------------------
//	x = xp[0];		// has been set earlier
//	y = yp[0];		// has been set earlier
	deltaY1 = (int32_t) yp[1]- yp[0];		// always deltaY1 >= 0
	deltaY12 = (int32_t) yp[2]- yp[1];		// Line 1_2
	// Note: For P2 == 0, deltaY12 = 0 definitely, since yp[2] = yp[1] and xp[2]- xp[1].
	
