IvesLiu1026/FinalProject_RustMiniOS/c_support/tft/src/stm324xg_lcd_ILI9341_Pro.c
	if (deltaY1 == 0){
	// If deltaY1 == 0 (yp[1] = yp[0]), there is NO the 1st triangle; 
			x02_mid = xp[0];		// (x02_mid, yp[1]) middle point of Line 0_2 is set at point 0
									// jump to the 2nd triangle.
	} else {
		// get the middle point of Line 0_2, which at the same Y level (yp[1]) of point 1
		// i.e., get (x02_mid, yp[1])
		if (deltaY12 == 0 ){
			x02_mid = xp[2];	// middle point of Line 0_2 is set at point 2; (x02_mid, yp[1]) = (xp[2], yp[2])
		} else{
			int_tmp = (deltaX2 * deltaY1) /deltaY2;
			x02_mid = (uint16_t)(xp[0] + int_tmp); // xp[0] + (yp[1]-yp[0])*((xp[2]-xp[0])/(yp[1]-yp[0]))
		}
	//====== 1st subtriangle (P0-P1-Px, where Px=(x02_mid, yp[1]) )
		if ( x02_mid < xp[1] ){ 
			// if Line 0_2 is left to Line 0_1, exchange THEM.
			int_tmp = deltaX1;
			deltaX1 = deltaX2;				// original Line 0_2
			deltaX2 = int_tmp;				// original Line 0_1
			int_tmp = deltaY1;
			deltaY1 = deltaY2;
			deltaY2 = int_tmp;
		}

			y1 = yp[1];	// end row
			i = 0;			// i = y - xp[0]
			if (pImageSt)
	//>>>>----------------------------------------------
			{	 // fill in the image buffer
				if ( y < Y0){			// note, y = xp[0]
					i = Y0 - y;			// i = Y0 - xp[0]
					y = Y0;					// initial row
				}
				if (y1 > Y_most) y1 = Y_most;		// end row
			}
	//<<<<---------------------------------------------
		for (uint16_t Yp=y; Yp<=y1; Yp++)	// downward
		{
				int32_t x_tmp, x_initial, length;
			
			if	(i == 0) {			// i = y - xp[0]
				x_tmp = 0;
				length = 1;
			} else {
				x_tmp = deltaX1*i /deltaY1;
				length = deltaX2*i /deltaY2- x_tmp + 1; // Note: length must >= 1, since new Line 0_2 is right to new Line 0_1
			}
			x_initial = x + x_tmp;	// x_initial
			
			if (pImageSt == 0){  // no image buffer
				if (length == 1) LCD_DrawPixel((uint16_t) x_initial, Yp, Tcolor); // point (x_initial, Yp)
				else LCD_DrawHLine((uint16_t) x_initial, Yp, (uint16_t) length);
			} else 
	//>>>>----------------------------------------------
			{	 // fill in the image buffer at row Yp
				x1 = x_initial + length - 1;		// x_end
				if ( x1 >= X0){								// draw only when column >= X0
					if (x1 > X_most) x1 = X_most;
					if (x_initial < X0)	x_initial = X0;
					offset = (Yp - Y0) * width;		// Yp >= Y0	
					offset += (x_initial-X0);			// note, x_tmp >=X0;
					// row Yp:  x_initial .....  x1
					for (uint16_t j = x_initial; j <= x1; j++){	// do only when x1 >= x_initial >= X0  > 0
						pBuffer[offset++] = Tcolor;
					}
				}
			}
	//<<<<---------------------------------------------
			i++;
		} 
		if (deltaY12 == 0 ) return; // There is NO the 2nd triangle.
	}			// else END of if (deltaY1 == 0) 
	//====== 2nd subtriangle 
second_Tri:	
	if ( x02_mid < xp[1] ){ // Original Line 0_2 is left to Line 1_2
		deltaX2 = (int32_t) xp[1]- xp[2];		// line 2_1
		deltaY2 = (int32_t) yp[2]- yp[1];		
		deltaX1 = (int32_t) xp[0]- xp[2];		// left side delta: line 2_0 on the left side
		deltaY1 = (int32_t) yp[2]- yp[0];	
	} else{	// for x0_mid >= xp[1]; Original Line 0_2 is right to Line 1_2
		deltaX1 = (int32_t) xp[1]- xp[2];		// left side delta: line 2_1 on the left side
		deltaY1 = (int32_t) yp[2]- yp[1];		
		deltaX2 = (int32_t) xp[0]- xp[2];		// line 2_0
		deltaY2 = (int32_t) yp[2]- yp[0];		
	}
		x = xp[2];
		y = yp[1];		// initial row
		y1 = yp[2];		// end row
		i = 0;				// i = yp[2] - L, first L = y1
		if (pImageSt)
	//>>>>----------------------------------------------
		{	 // fill in the image buffer
				if ( y < Y0) y = Y0;	// initial row
				if (y1 > Y_most){			// end row
					i = y1 - Y_most;		// i = yp[2] - L, first L = Y_most
					y1 = Y_most;				// end row
				}
		}
	//<<<<---------------------------------------------
		for (int16_t L=y1; L>=y; L--)			// upward, NOTE: yp[1] may be 0
		{
				int32_t x_tmp, length;
				
			if	(i == 0) {					// i = yp[2] - L
				x_tmp = 0;
				length = 1;
			} else {
				x_tmp = deltaX1*i / deltaY1;
				length = deltaX2*i /deltaY2- x_tmp + 1; // Note: , length must >= 1, since (deltaX2/deltaY2) >= (deltaX1/deltaY1) > 0
			}

			if (pImageSt == 0){  // no image buffer
				if (length == 1) LCD_DrawPixel((uint16_t) (x+x_tmp), L, Tcolor);
				else LCD_DrawHLine((uint16_t) (x+x_tmp), L, (uint16_t) length);
			} else 
	//>>>>----------------------------------------------
			{	 // fill in the image buffer
				x_tmp = x + x_tmp;	// x_initial >= 0
				x1 = x_tmp + length - 1;		// note, x_end >= x_initial
					if (x1 >= X0){				// draw only when column >= X0
						if (x1 > X_most) x1 = X_most;
						if (x_tmp < X0)	x_tmp = X0;
						offset = (L-Y0) * width;			// 
						offset += (x_tmp-X0);			// note, x_tmp >=X0;
						for (uint16_t j = x_tmp; j <= x1; j++){	// do only when x1 >= x_tmp >= X0 > 0
							pBuffer[offset++] = Tcolor;
						}
					}
			}
	//<<<<---------------------------------------------
			i++;
		}	
}
*/
